[
  {
    "level": "advanced",
    "page": 1,
    "text": "CHAPTER 1 -  املتعد ِّي حبرف\n1.0 RECOMMENDED REVIEW \n✓ Passives (Chapter 8 – Beginning  )نحو\n ❖Give special attention to “Transitivity” (8.4) \n \n✓ Be able to recognize irregular passive  – أفعالfocus on ( مضاعفChapter 7) and ( أجوفChapter 8) \n1.1 INTRODUCTION  \nRecall that a  فعلthat is  الزمcannot take a  .مفعول بهFor example, the action (  مَ  نَاto sleep) is  الزمbecause you \ncannot say  َنَام\nهُ \n( he slept him/it).  \nRecall also that a passive  فعلis one in which the doer is unknown and that when converting an active \nsentence to a passive sentence, the  مفعول بهbecomes your “done-to” (the    .)نائب الفاعل\nIn a sentence with no  ,مفعول بهthere is nothing that can be converted into a  .نائب الفاعلThe  نائب الفاعلis an \nessential part of a passive sentence. This means that  أفعالthat are  الزمcannot be made passive because \nthey cannot take   .مفعول به\nThere is, however, one special method by which a  الزمword can be made passive. A  الزمword can be \nmade passive through the use of a preposition (a  .)حرفFor example, you cannot say “He was slept,” but \nyou can say, “The bed was slept IN.” The  حرفhere allows you to add a detail you otherwise would not \nhave been able to add – it converted the  فعلfrom  الزمto  متعد ِّيthrough the use of a  ,حرفwhich, in \neffect, allows it to be made passive. That is what is called  .املتعدي حبرف\n1.2 MAKING الزمة أفعال PASSIVE \nHOW IT WORKS \nAs mentioned previously,  حروفcan be used to allow a  فعل الزمto function like a . متعديOnce a  فعلis \nfunctioning like a  ,متعديit naturally follows that it can be made passive. Take a look at the examples \nbelow.  \nHe slept in the bed. ➔ The bed was slept in. \n   نَامَ يف الَّسَّ يْر \n   ن يْمَ يف الَّسَّ يْر\n  \n \nShe sat down on the chair. ➔ The chair was sat on.  \n ِّ   جَلَسَ تْ لَعَ َ الكُرْس \n ِّ   جُل سَ لَعَ َ الكُرْس\n2",
    "language": "en"
  },
  {
    "level": "advanced",
    "page": 2,
    "text": "Allah condemned them/became angry with them. ➔ They were condemned/recipients of anger.  \n ْ غَض  بَ اهللُ عَلَيْه م \n ْ غُض  بَ عَلَيْه م\n \nTake a look at the following example to see how this works.  \nRecall that the  \"فعل \"جاءmeans “to bring” when it is accompanied by the \" .حرف \"باءLet us use this  فعلas a case study.  \n  جَاؤ\n وْا\nبِالكِتَابِ \n \nThey brought the book. \n \nIf we were to convert the sentence “They brought the book”, into passive IN ENGLISH, we would say:  \nThe book was brought. \n \nSo how do we say that in Arabic?  \n \nIn order to convert an active sentence to a passive sentence, you need to get rid of the doer. Since the doer is an \ninside pronoun, we remove the doer by bumping the  فعلback to its original  هوform, then we make the  فعلpassive.  \n \n    جَاؤُوْا\n        \n           َجَاء\n   \n َ  ِج  ْء\n  ِج  ْءَ \nب الك تَاب  \n \nThe book was brought. \n \nNormally, our  مفعول بهwould become our  ,نائب الفاعلbut in this case we do not have a مفعول\nبه \n ,only a  .متعلق بالفعلSo the \n متعلق بالفعلbecomes ourنائب الفاعل\n \n .Notice how it is translated as the  ,نائب الفاعلdespite its being a   .جار وجمرور\nHOW TO RECOGNIZE \nNow that we have learned this concept, the question is, how do we recognize when a \n جار\nوجمرور\n is acting \nas the  ?نائب الفاعل\nThe best way is to know your vocabulary and to know which  أفعالare associated with which   .حروف\nkill the doer \nmake it passive \n original  فعل\n3",
    "language": "en",
    "section_title": "المتعدي بحرف"
  },
  {
    "level": "advanced",
    "page": 3,
    "text": "It is also important to keep the following rules in mind:  \n1. The  فعلwill always be SINGULAR MASCULINE (in the  هوform) \n2. The  جار وجمرورshould translate as your  نائب الفاعل\nMeaning: a  فعلthat is not in the  هوform will not have a  جار وجمرورas a   !نائب الفاعل\nQUR’ANIC EXAMPLES \nLook at the following Qur’anic examples.  \n َوَجِاْيٓء\n \nيَوۡمَئِذ  \n \nِبِ َهَنَّمَ  \n  ٣٢ … \nOn that day, Jahannam will be brought forth.  \nThe  \"فعل \"جاءhas the meaning of “to bring” when it comes with the .\" حرف \"باءNotice that the  فعلis in the  هوform ( )ِجءand \nthat the  )جبهنم( جار وجمرورis translated as the ( .نائب الفاعلWhat was brought? Jahannam.) \n \n َحِيط\n \nوَأ\n \nبِثَمَرِهِ \nۦ \nصۡ \nَ\nفَأ\nبَحَ ي قَل ِب  كَفَّيۡ \nنفَقَ فِيهَا وَِهِ َ خَاوِيَةٌ لَعَ َ ٰ ع ر وشِهَا \nَ\nهِ لَعَ َ ٰ مَآ أ\n   ٢٤ …\nHis crops were surrounded, then he started wringing his hands while it was collapsed in on its \nturrets because of what he spent for its sake. \nThe  \"فعل \"أحاطcomes with the ,\" حرف \"باءand cannot take a direct . مفعول بهNotice that the  فعلis in the  هوform (حيط\nُ\n )أand that \nthe  )بثمره( جار وجمرورis translated as the .( نائب الفاعلWhat was surrounded? His crops.) \n \n  ي طَ اف\n \nعَلَيۡهِم\n \nبِصِ حَافٖ م ِن \nكۡوَابٖ  \nَ\nذَهَبٖ وَأ\n  ١٧ … \nPlatters and cups made of gold are circulated amongst them. \nThe \" فعل \"طافcomes with the ,\" حرف \"باءand cannot take a direct . مفعول بهNotice that the  فعلis in the  هوform ( )يُطافand that \nthe  )بصحاف...( جار وجمرورis translated as the ( .نائب الفاعلWhat is circulated? Platters and cups of gold.) \nNotice that there are two  جار وجمرورin the sentence. So how do we decide which one is the  ? نائب الفاعلWe go with the  حرف\nthat is associated with the  ;فعلsince  طافcomes with the \n حرف\n\"باء\",\n that is what becomes the   .نائب الفاعل\n \n1.3 MAKING مفعول اسم OUT OF الزمة أفعال \nRecall that an  اسم مفعولis the passive version of an  .اسم فاعلIn the  رصف صغريthe  اسم مفعولappears in the \npassive line. We initially learned that since  أفعال الزمةcannot be made passive, they cannot have an  اسم\n  .مفعول\n4",
    "language": "en",
    "section_title": "المتعدي بحرف"
  },
  {
    "level": "advanced",
    "page": 4,
    "text": "The rules for making an  اسم مفعولout of a  فعل الزمare the same as making it passive: \n1. The  اسم مفعولhas to be SINGULAR AND MASCULINE \n2. The \"done-to\" will be attached to the  حرف اجلر\nThis piece of grammar is not new to us; we encounter it at least seventeen times a day. Take a look at \nthe following example: \n… \n ۡغَۡيۡ ِ ٱلۡمَغۡض  وبِ عَلَيۡهِم\n… ٧  \n…not those who are the objects of anger…  \nThe \" فعل \"غضبcomes with the \" .حرف \"لَعNotice that the  اسم مفعولis singular and masculine ( ,)مغضوبand those who are \nreceiving the action are attached to the  .)عليهم( حرف اجلر\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n5",
    "language": "en",
    "section_title": "المتعدي بحرف"
  },
  {
    "level": "advanced",
    "page": 5,
    "text": "CHAPTER 2 - \"نْواعُ \"ما\nَ\n أ\n2.0 RECOMMENDED REVIEW \n✓ ( ما االستفهاميةChapter 6.8 – Beginning  )نحو\n \n( ما النافية ✓Chapter 9 – Beginning  )نحو\n ❖Give special attention to “Negation of ( ”الجملة االسمية9.3) \n \n✓ ( ما الموصولةChapter 12 – Advanced  )نحو\n \nر طية ✓\n( ما الشChapter 14 – Advanced  )نحو\n \n2.1 INTRODUCTION  \nIn our studies thus far we have encountered  ماin many different types, each serving a unique function. \nSo far we have learned:  \n1.  ما املوصولة\n ِ َّ ِسَبَّحَ لِل\n  مَا \nۡرضِ  \nِفِ ٱلسَّ مَ ٰوَ ٰتِ وَٱۡلۡ َ\n \nوَه وَ ٱلۡعَزِيز  \n ٱۡلۡ َكِيم  \n١  \nWhatever is in the skies and the earth praises Allah, and He is the mighty, the wise. \n \n2. ما استفهاميِّة\n \n( question   )ما\n  قَالَ فِرۡعَوۡن\n  وَمَا\nرَبُّ ٱلۡعَ ٰلَمِنيَ \n  ٣٢\nFirawn said, “What is the master of the worlds?” \n \n3.  ما( ما انلافيةof refutation) \n \n...  وَمَا\nه م بِخَ ٰرِجِنيَ مِنَ ٱنلَّارِ \n  ٧٦١\nNo, they are not exiting from the fire! \n \n4. ( ما رشطيِّةthe conditional  )ما\n...   وَمَا\nت نفِق واْ مِن َشَ ۡ ءٖ ِفِ سَبِيلِ ٱلِلَّ ِ \n \nنت مۡ الَ ت ظۡ لَم ونَ \nَ\nي وَفَّ إَِلَ ۡك مۡ وَأ\n  ٠٦ \n6",
    "language": "en",
    "section_title": "المتعدي بحرف"
  },
  {
    "level": "advanced",
    "page": 6,
    "text": "Whatever you spend of anything in the path of Allah, it will be payed to you in full and you \nwill not be wronged. \n \n5.  ما( ما اتلعجُّبيِّةof amazement)  \n... \n ٓ  فَمَا\nصۡ َبَ َه مۡ لَعَ َ ٱنلَّارِ \nَ\nأ\n  ٥٧١\nHow persistent they are in pursuit of the fire! \n \nIn this chapter, we will cover the remaining roles of  .ماThey are:  \n1.  ما الزائدة\n2.  ما املصدريِّة\n3.  ما الزمانيِّة\n2.2 الزائدة ما \nRULES OF   ما\nزائدة\n \nRecall that  زائدةmeans extra. That is not to say that the  حروف زائدةserve no function. Rather, it means \nthat the sentence would still be grammatically complete and correct if it were to be removed. What, \nthen, is the function of   ?ما الزائدة\nRecall the functions of  من زائدةand  باء زائدةfrom beginning  .حنوThey served to make the sentence more \nemphatic, giving the meaning \"not a single\" and \"not at all,\" respectively.   \nSimilarly, the purpose of  ما زائدةis emphasis. Let us explore the different contexts in which  ما زائدةis used. \nThe  ما زائدةcan appear in fragments and sentences. Let us learn about each.   \n  ما\nزائدة\n ON A FRAGMENT LEVEL \nOn a fragment level,  ما زائدةcan interrupt fragments that do not usually have a long-distance relationship, \nparticularly  اجلار واملجرورand  .املوصوف والصفةIt is considered    ,غري اكفَّةwhich simply means that it allows for \nthe transfer of status. Let us look at some examples.  \n ِ  مَا فَب\nرَۡحۡ َةٖ م ِنَ ٱلِلَّ ِ نلِ تَ لَه مۡۖۡ \n  ٩٥١ …\nSo only by the mercy from Allah were you lenient to them! \nNotice how  ماis coming between the  )بـ( حرف جرand the  )رمحة( جمرورand how the sentence is more emphatic as a result. Note \nthat the exclusivity (“only”) is a result of the   متعلقcoming before the  .)تقديم اللفظ لَع اعمله( فعل\n7",
    "language": "en",
    "section_title": "Types of ما"
  },
  {
    "level": "advanced",
    "page": 7,
    "text": "ٖي ِ ص  ورَة\nَ\nِفِ ٓ أ\n  مَّا\nشَآءَ رَكَّبَكَ \n٨  \nIn any form He willed, He put you together.  \nNotice that  ماis interrupting a\n \n  ,صورة( موصوفa common word) and its  ,شاء( صفةa  .)مجلة فعليةNote the  تقديمof the    .متعلق بالفعل\n  ما\nزائدة\n ON A SENTENCE LEVEL \n ما زائدةcan come in both  مجلة اسميةand  .مجلة فعليةIts placement within the sentence is variant and does not \nadhere to particular rules, only that it will come within the body of sentence.   \nNote that oftentimes sentences in which  ما زائدةappears have a lot of  تقديمand  ,تأخريthus the parts of the \nsentence are not in their normal order. Let us look at some examples.  \n َوَمَا ه وَ بِق\nوۡلِ شَاعِرٖٖۚ قَلِيٗلا \n  مَّا\nت ؤۡمِن ونَ \n  ١٤\nوَالَ بِقَوۡلِ َكَ هِنٖٖۚ قَلِيٗلا \n  مَّا\nتَذَكَّر ونَ \n  ٢٤\nNo, it is not at all the speech of a poet. How little you believe! Nor is it at all the speech of a \nsoothsayer. How little you remember! \nHere,  ما زائدةhas appeared in a  .جلمة فعليةIt is coming between the  مفعولand the  .فعلAlso note how the  مفعولis brought \nbefore the\n . فعلThis particular structure ( )قليال ما تفعلونis the most common way  ما زائدةoccurs in Quran. \n \n \n…\n ِِإَونَّ كَثِۡياا م ِنَ ٱۡلۡ لَطَ آءِ َلَ َبِۡغِ بَعۡض  ه مۡ لَعَ َ ٰ بَعۡضٍ إِالَّ ٱَّلَّ ِينَ ءَامَن واْ وَعَمِل واْ ٱلصَّٰلِحَ ٰت\n \nوَقَلِيلٞ \nه مۡ    مَّا\n   ٤٢  … \nCertainly, many business partners… some of them transgress over others, except for those \nwho believed and did good deeds – and how few they are! \nHere,  ما زائدةhas appeared in a  .مجلة اسميةIt is coming between the  خربand the  .مبتدأAlso note how the  خربis brought before \nthe   .مبتدأ\n  ما\nزائدة\n IN CONDITIONAL SENTENCES \n ما زائدةalso appears in conditional sentences, usually with  .إنScript-wise, it is written both as  إ نْ مَاand  .إمَّا\nIt is also used for emphasis and is always accompanied by  ,نون اتلوكيدas far as Quranic usage goes. \nEmphasis on a  رشطsimply means that the likelihood of occurrence is much stronger. \n \n...فَإِمَّا\n \nحَدا ا\nَ\nتَرَيِنَّ مِنَ ٱلۡبََشَ ِ أ\n \nكَل ِمَ ٱَلۡ َوۡمَ إِنسِي اا\n \nِ نَذَرۡت  لِلرَِّنَٰمۡح صَ وۡماا فَلَنۡ أ\nفَق وِلِ ٓ إِّن \n  ٦٢ \nIf you see (and you certainly will see) any person, then say, “I have vowed a fast for the \nintensely Merciful, I won’t speak to a single person today.” \n8",
    "language": "en",
    "section_title": "Types of ما"
  },
  {
    "level": "advanced",
    "page": 8,
    "text": "This ayah is in the context of Maryam AS after she gave birth to ‘Isa. The likelihood of her running into a person is high, s o \n ما زائدةis used.  \n \n۞\n… \n َوۡ لِكِ َ ه مَا ف\nَ\nحَد ه مَآ أ\nَ\nإِمَّا يَبۡل غَنَّ عِندَكَ ٱلۡكَِبَ َ أ\nف  ٖ وَالَ تَنۡهَرۡه مَا وَق ل لَّه مَا قَوۡالا كَرِيماا \n \nٗلَ تَق ل لَّه مَآ أ\n  ٣٢\nIf one of them or both of them reach old age around you (and it is very likely to happen), then \ndo not express exasperation to them and do not drive them away and say kind words to them.  \nThis ayah is talking of parents coming to old age. It is something that is bound to occur should someone live to their later \nyears. Notice, however, that  إنis used as opposed to  .إذاThis is because it is not certain that everyone will reach old age.  \n \n**Note that the  المof emphasis also often appears on (   .)لَئThis     نْ  إserves the purpose of emphasis, but \nnot the same type of emphasis as the  .ما الزائدةWhile the \n ال ما\nزائدة\n gives the meaning “If this happens, and \nit certainly will,” the  المof emphasis gives the meaning, “I swear, if this happens…” The  ما زائدة\nemphasizes the  رشطand the  المof emphasis emphasizes the    .جواب\nال ما \nزائدة\n can also come with  إذاfor emphasis. Because  إذاalready implies the sureness of the occurrence of \nan action, the  ماdoes not make the likelihood of occurrence stronger – rather, it adds the meaning of \n“finally” or “actually”.  \n ِٓإَوذَا مَا\n \nنزِلَتۡ س ورَةٞ \n \nأ\n \nيُّك مۡ زَادَتۡه  هَ ٰذِهِۦٓ إِيمَ ٰناا \nَ\nفَمِنۡه م مَّن يَق ول  أ\n   ٤٢١ …\nWhen a surah is finally revealed, from amongst them [the hypocrites] are those who say, \n“Which of you has this increased in faith?” \n  \n2.3 – املصدرية ما \nWe have encountered two of the  حروف مصدريةin our studies  رصفstudies:  ْ أنand  َّ ما .أنis another tool to \nmake a “fake” ( مصدر\nاملصدر\n \nالمُؤَوَّل\n .)\nA good way to test whether a  ماis  مصدريةor not is to replace it with the actual  مصدرand it should still \nmake sense.  \n ِحۡسَ نَ ٱلۡقَصَ ص\nَ\nَنَ ۡن  نَق صُّ عَلَيۡكَ أ\n  بِمَآ \nوۡحَيۡنَآ \nَ\nأ\n \nإَِلَ ۡكَ \n \n  هَ ٰذَا\nٱلۡق رۡءَانَ \n \nِإَون ك نتَ مِن قَبۡلِهِۦ لَمِنَ ٱلۡغَ ٰفِلِنيَ \n٣  \nWE relate to you the best of stories through our revealing this Quran to you, even though you \nwere certainly, from before, among those who are unaware. \n9",
    "language": "en",
    "section_title": "Types of ما"
  },
  {
    "level": "advanced",
    "page": 9,
    "text": "Notice how the translation of a  مصدرis retained in the translation (“-ing” ending). Notice how the pronoun  حننis retained in \nthe translation (our revealing). The  ماand its  صلةcan be replaced by  َ بإحيائنا إيلك هذا القرآنand retain the same meaning. \n \n َمۡ يَق ول ونَ ٱفَۡتَ َىٰه ۖۡ ق لۡ إِنِ ٱفَۡتَ َيۡت ه ۥ ف\nَ\nأ\nنَا۠ بَرِيٓءٞ \nَ\nعََلَ َّ إِجۡرَاِمِ وَأ\n  م ِمَّا\nُت  ۡرِم ونَ \n  ٥٣ \nOr do they say he made it up? Say, “If I make it up then my crimes are against me, and I am \ninnocent of your crimes.” \nNotice how the translation of a  مصدرis retained in the translation (the idea of “crimes”). Notice how the pronoun  أنتمis \nretained in the translation (your crimes). The  ماand its  صلةcan be replaced with  إجرامكمand retain the same meaning. \n  ما\nمصدرية\n VS   ما\nموصولة\n \nOftentimes, a  ماcan be interpreted as either a  ما مصدريةor a \n ما\nموصولة.\n This can only happen when there is \nno  اعئدbecause  حروف مصدريةDO NOT HAVE A   .اعئدThe ayah will be translated differently depending on \nthe grammatical interpretation.  \n \n...\n ِوَٱَّتَّ َذ وٓاْ ءَايَ ِٰت\n  وَمَآ \nنذِر واْ \n \nأ\n \nه ز واا \n  ٦٥\n…and they took My signs and what they were warned of as a mockery . \n…and they took My signs and their warning as a mockery. \nThe first translation is interpreting  ماas  ,موصولةand the second as  .مصدريةNotice how the translation of a  مصدرis retained in \nthe second translation (“-ing” ending). Also note how the pronoun  همis retained in the translation as well (“their warning”). \nIt is similar to saying   .آيايت وإنذارَهم\n \n …\nوَكَثِۡيٞ م ِنۡه مۡ سَآءَ \n  مَا\nيَعۡمَل ونَ \n   ٦٦ \nAnd many of them… how terrible is whatever they do! \nAnd many of them… how terrible their deeds are! \nThe first translation is interpreting  ماas  موصولةand the second as .\n.  مصدريةNotice how the translation of a  مصدرis retained in \nthe second translation (the idea of something). Also note how the pronoun  همis retained in the translation as well (“their \ndeeds”). It is similar to saying    .ساءَ عملُهم\n \n \n10",
    "language": "en",
    "section_title": "Types of ما"
  },
  {
    "level": "advanced",
    "page": 10,
    "text": "2.4 – الزمانية ما \nThis  ماis translated as “as long as” or “as much as”. It is always followed by a  فعلwhich is translated in \nthe present tense, regardless of the tense of the  فعلthat follows it.  \n َ َّفَٱتَّق واْ ٱلِل\n  مَا\nٱسۡتَطَ عۡت مۡ \n  ٦١ …\nSo be conscious of Allah as much as you are able. \nNotice that the  فعلfollowing  ماis in the past tense, yet it is translated as present tense.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n11",
    "language": "en",
    "section_title": "Types of ما"
  },
  {
    "level": "advanced",
    "page": 11,
    "text": "CHAPTER 3 -  الضمۡي\n3.0 RECOMMENDED REVIEW \n✓ The Referee Pronoun (Chapter 4.6 – Beginning  )نحو\n \n ✓Complex Sentences (Chapter 5.6 – Beginning  )نحو\n3.1 INTRODUCTION  \nPronouns were amongst the first topics we covered, as they are the backbone of the Arabic language. \nWe learned the three types of pronouns (independent, attached, and inside) and the specific statuses \nand functions of each. In this chapter, we will explore some of the non-standard uses of pronouns.  \nThe topics are as follows:  \n1.  ضمري الفصل\n2.  ضمري الشأن\n3.  العطف لَع الضمري املسترت\n3.2 الفصل ضمۡي \n ضمري الفصلis what we previously referred to as the “referee pronoun”. We learned that it is an \nindependent pronoun that matches with the  مبتدأin number and gender, and it comes between an  اسم\n اإلشارةand a  خربthat has  .الHowever, it serves more than just that function.  \nLet us take a look.  \nCONFIRMING THE  خَب\nWe previously knew referee pronouns only to come between an اس\n  م اإلشارةand a  خربwith  .الWe learned \nthat its function is to confirm that the  خربis indeed a  ,خربand not a  .مشار إيلهA  ضمري الفصلcan also come \nbetween a  مبتدأand a  خربthat may otherwise be confused as a fragment chain. Look at the following \nexamples: \n \n…\n َوَٱلۡكَ ٰفِر ون\n  ه م  \nٱلظَّٰلِم ونَ \n  ٤٥٢\nThe disbelievers are the wrongdoers .  \nHad the  همnot been there,  الظاملونcould have been interpreted as a  صفةor  بدلof  .الاكفرونHowever, the  ضمري الفصلconfirms its \nrole as  .خرب\n \n \n12",
    "language": "en",
    "section_title": "Types of ما"
  },
  {
    "level": "advanced",
    "page": 12,
    "text": "…\n ِ َّوََكَ ِمَة  ٱلِل\n ِهِ َ \nٱلۡع لۡيَا \n  ٠٤ …\nThe word of Allah is the highest .  \nHad the  يهnot been there,  العلياcould have been interpreted as a  صفةof  .لكمةHowever, the  ضمري الفصلconfirms its role as a \n  .خرب\nEXCLUSIVITY  االختصاص\n ضمري الفصلcan also be used for  ,االختصاصor exclusivity. There are two types of  االختصاص احلقيقِّ  :اختصاص\nand   .االختصاص لَع وَجْه  المُبالغة\n االختصاص احلقيقِّ means true exclusivity; there is ABSOLUTELY NOBODY that this information applies to \noutside of who was mentioned.  \n \n…\n إِنَّه ۥ\nٱلَّ   ه وَ \nوَّاب  ٱلرَّحِيم  \n  ٧٣\nCertainly, He (and only He) is the ever-pardoning and the constantly merciful. \nThis is  اختصاص حقيقbecause Allah – and only Allah – is  اتلواب الرحيمand this quality cannot be used to describe anyone but \nAllah. \n \n االختصاص لَع وجه امل\nبالغة\n means that there can be others who this information applies to, but this group is \nthe most deserving of being associated with this quality. \n ۡالَ ٓ إِنَّه م\nَ\nأ\n  ه م  \nٱلۡم فۡسِد ونَ وَلَٰكِن الَّ يَشۡ ع ر ونَ \n  ٢١\nListen up! They are the ones who cause corruption, however they do not perceive. \nThis is  .االختصاص لَع وجه املبالغةThe people mentioned in this passage (the hypocrites) are not the only ones who cause \ncorruption (there are plenty of others who do so), but they are the most deserving of being described as such.  \n الوكيد\n ضمري الفصلcan also be used for emphasis. Note that  ضمري الفصلdoes not have an effect on the sentence \ngrammatically. Previously, we have known independent pronouns to create a new sentence, but that is \nnot the case with  ;ضمري الفصلit has no grammatical role, just a rhetorical one.  \n ْوَنََصَ ۡنَ ٰه مۡ فََكَ ن وا\n  ه م  \nٱلۡغَ ٰلِبِنيَ \n  ٦١١\nWe gave them victory, so they were the ones who overpowered! \nNotice how the  خربof  اكنremained  .)الغابلني( منصوب\n13",
    "language": "en",
    "section_title": "Pronouns"
  },
  {
    "level": "advanced",
    "page": 13,
    "text": "ْوَقَوۡمَ ن وحٖ م ِن قَبۡل  ۖۡ إِنَّه مۡ َكَ ن وا\n  ه مۡ \nطۡ ِغَ ٰ \nَ\nظۡ لَمَ وَأ\nَ\nأ\n  ٢٥\nAnd the people of Nuh from way before. Certainly, THEY were more oppressive and more \nrebellious! \nThere is a double emphasis here with  إنهمalong with  .ضمري الفصلNotice how the  خربof  اكنremained  .)أظلمَ وأطىغ( منصوب\n3.3 الشأن ضمۡي \nPreviously, we learned that pronouns must always refer back to something that has already been \nmentioned. For example, “My sister was sick, so she didn’t go to school.” We know that the pronoun \n“she” is referring back to “my sister.”  \nThat is not the case with  .ضمري الشأنIt is a pronoun that comes at the beginning of a sentence and refers \nback to nothing. Its function is simply to proclaim the importance of the statement to come.  \nThe grammatical rules of  ضمري الشأنare as follows: \n1. Always singular, always 3rd person (will always be either  هوor  .)يه\n2. It will not have an  اعئدwithin the sentence. \n3. It can be attached, detached, or inside, but it will most often be attached to a   .حرف نصب\n***NOTE that ضمري الشأ\nن\n will not be translated as an actual pronoun (he/she/it), as its function is not the \nfunction of a normal pronoun. \nTo understand the difference in the functions of the pronoun, compare the following three sentences:  \nامللك قادم\n!  \nThe king is coming! \nThis sentence is a normal informational sentence.  \nامللك هو قادم\n!  \nThe king (and nobody else) is coming!      \nThe king, he is coming! \nThis sentence has  ,ضمري الفصلeither making it exclusive or emphasizing it. \nهو امللك قادم\n!  \nImportant news! The king is coming! \nThis sentence has  ,ضمري الشأنaggrandizing the topics of the upcoming sentence. The  )هو( ضمري الشأنis not translated. \n \n14",
    "language": "en",
    "section_title": "Pronouns"
  },
  {
    "level": "advanced",
    "page": 14,
    "text": "Now take a look at the following examples of  ضمري الشأنin Quran.  \n ۡو\nَ\nظۡ لَم  مِمَّنِ ٱفَۡتَ َىٰ لَعَ َ ٱلِلَّ ِ كَذِبًا أ\nَ\nوَمَنۡ أ\nكَذَّبَ أَ‍ِب\nيَ ٰتِهِۦٓ  إِنَّ \nه  \nۥ الَ ي فۡلِح  ٱلظَّٰلِم ونَ \n   ١٢\nWho is more wrongdoing than whoever falsely attributes lies to Allah or denies His signs? \n[The great matter is that] those who do wrong will not succeed!  \nNotice that the  ـهon  إنهdoes not translate as a pronoun at all. It is not a pronoun that refers to anything that came before \nit. \n \n َّ  ه ۥ إِن\nتِ رَبَّه ۥ ُم  ۡرِماا فَإِنَّ َلَ ۥ جَهَنَّمَ الَ يَم وت  فِيهَا وَالَ َيَ َۡيَ ٰ \nۡ\nمَن يَأ\n  ٤٧\n[The great matter is that] whoever comes to his Master as a criminal, then for him is \nJahannam, he neither dies nor remains alive in it. \nNotice that the  ـهon  إنهdoes not translate as a pronoun at all. It is not a pronoun that refers to anything that came before \nit. \n \n3.4 – المستَت الضمۡي لَع العطف \nWhen we first began our study of the  ,فعلwe learned that a  فعلcan have either an inside doer or an \noutside doer. An inside doer is a pronoun which is imbedded in the conjugation of a  .فعلWe know, for \nexample, how to say, “I went”.  \n. ُذَهَبْت\n \nWe also know how to say, “Ahmed went”.  \n.ُمحْ َد\nَ\nذَهَبَ أ\n \nThe question at hand is, how do we say, “Ahmed and I went”? \n \n\n ُمحْ َد\nَ\nذَهَبْتُ وَأ\n \nThis is grammatically incorrect, as  عطفcan only happen between two like words.  \nThe solution: pull out the pronoun from inside the  فعلand do  عطفof the  فاعلonto the “outside” \npronoun.  \n \n15",
    "language": "en",
    "section_title": "Pronouns"
  },
  {
    "level": "advanced",
    "page": 15,
    "text": "✓\n نَا\nَ\nذَهَبْتُ أ\nمحْ َدُ \nَ\nوَأ\n \nThe pronoun is pulled out from the  )أنا( فعلand the second doer is  معطوفonto the pronoun. This is not considered an \noutside doer; it does not adhere to the rules of having outside doers. \nThis can happen with any of the  ص  يَغof  .أفعالAlso, note that the pronoun will not be repeated in the \ntranslation. \n \n ۡٱذۡهَب\nنتَ \nَ\nأ\n \nخ وكَ \nَ\nوَأ\n بِ‍َٔا\nيَ ِٰتِ وَالَ تَنِيَا ِفِ \n ذِكۡرِي \n  ٢٤\nYou and your brother go with Our signs and do not be lax in My remembrance. \nThe inside doer of the  )أنتَ ( فعل أمرis taken out of the  فعلand  أخوكis  معطوفonto it. \n \n ۡقَالَ لَقَدۡ ك نت م\nنت مۡ \nَ\nأ\n \nوَءَابَآؤ ك مۡ \n \nِفِ ضَ لَ ٰلٖ مُّبِنيٖ \n  ٤٥\nHe said, “You and your forefathers have certainly been in clear misguidance.” \nThe inside doer of the  )أنتم( فعل ماضwas pulled out of the  فعلand  آباؤكمis  معطوفonto it. \n \n \n \n \n \n \n \n \n \n \n \n \n \n16",
    "language": "en",
    "section_title": "Pronouns"
  },
  {
    "level": "advanced",
    "page": 16,
    "text": "CHAPTER 4 - \n فاء\nالسَّ بَب يَّة\n \n4.0 RECOMMENDED REVIEW \n✓ Reasons to change the status of a  فعل مضارع\n  حروف ❖Associated with ( الفعل المضارع7.3 – Beginning  )نحو\nر ط الجازمة ❖\n( أدوات الشChapter 14.2 – Advanced  )نحو\n( األمر وجواب األمر ❖Chapter 14.6 – Advanced  )نحو\n \n ✓How different irregularities manifest light and lightest  \n❖ Focus on ( مضاعفChapter 7) and ( ناقصChapter 9) \n4.1 INTRODUCTION  \nRecall that  األمر وجواب األمرis a two-part structure that is made up of: \n1. A command  \n2. What will happen as a result of the command being followed \nThis structure, however, is limited to commands and does not include forbidding verbs. There is a \nspecific, separate grammatical structure that serves a similar function to the  األمر وجواب األمرstructure, \nbut it involves forbidding rather than commanding.  \nThis structure is known as  .فاء السببية\n4.2 STRUCTURE AND GRAMMAR \nAs mentioned previously,  فاء السببيةis like the negative version of  .األمر وجواب األمرIt is a structure that \nincludes a  نيهas well as the reasoning (the  )سببbehind this prohibition.   \nThis structure translates best as “Do not X, or else/otherwise…”  \nThough this structure serves a similar function, it looks different grammatically. This structure is made \nup of three parts: \n1. a  فعل نيه\n2. a   اء ف\n3. a  فعلdirectly following the  فاءthat is ( منصوبlight) \nTake a look at the examples below.   \n ْ  ُك  وا\nمِن طَ ي ِبَ ٰتِ مَا رَزَقۡنَ ٰك مۡ \nوَالَ تَطۡ غَوۡاْ فِيهِ \nفَ  \nيَحِلَّ عَلَيۡك مۡ غَضَ ِبِ \nوَمَن َيَ ۡلِلۡ عَلَيۡهِ غَضَ ِبِ فَقَدۡ هَوَىٰ \n  ١٨\nEat from the pure of that which We have blessed you with and do not transgress regarding it, \nor else My anger will descend upon you. And whoever My anger descends upon has certainly \nfallen. \n17",
    "language": "en",
    "section_title": "Pronouns"
  },
  {
    "level": "advanced",
    "page": 17,
    "text": "The ayah above follows the  فاء السببيةstructure. There is a  )ال تَطْ غَوْا( نيهfollowed by a  فاءfollowed by a \n \n ) َّ(فيح  ل\nفعل مضارع منصوب\n .\nNotice that the  فاء السببيةclause explains the reason behind the  نيهand translates as “otherwise” or “or else”. \n \n ِيَ ٰقَوۡم\n \nٱدۡخ ل واْ \n \nۡرضَ \nٱۡلۡ َ\n \nٱلۡم قَدَّسَةَ \n \nٱلَِّتِ \n \nكَتَبَ \nٱلِلَّ  \n \nلَك مۡ \nوَالَ تَرۡتَدُّواْ \nدۡبَارِك مۡ \nَ\nلَعَ َ ٰٓ أ\nتَ فَ  \nنقَلِب واْ خَ ِٰسِ ِينَ \n  ١٢\nMy people,enter the holy land that Allah has decreed for you and do not turn back on your \nheels, or else you will return as losers.  \nThe ayah above follows the  فاء السببيةstructure. There is a ( نيه\nوال تر\nتدوا\n )followed by a  فاءfollowed by a  )فتنقلبوا( فعل مضارع منصوب\nNotice that the  فاء السببيةclause explains the reason behind the  نيهand translates as “otherwise” or “or else”. \n4.3 السببية فاء OUTSIDE OF FORBIDDING  \nThere is one case in which  فاء السببيةfollows something other than a  .نيهIt is often seen following a wish \nor desire. The part following the  فاءexplains why the speaker has this wish or desire. In such cases,  فاء\n السببيةtranslates best as “as a result” or “because”.  \nTake a look at the examples below.  \n \n ۡوَلَئِن\n \nصَ ٰبَك مۡ فَضۡ لٞ م ِنَ \nَ\nأ\nٱلِلَّ ِ \n \nن لَّمۡ تَك نۢ بَيۡنَك مۡ وَبَيۡنَه  \nَ\nَلَ َق ولَنَّ كَأ\nۥ \nمَوَدَّةٞ \nيَ ٰلَيۡتَِنِ ك نت  مَعَه مۡ \nفَ  \nف وزَ فَوۡزًا عَظِيماا \nَ\nأ\n   ٣٧\nCertainly, if bounty comes to you from Allah, he will most definitely say, as though there has \nbeen no love between you and him “I wish I was with them then [as a result] I would have \nattained something great!”   \nThe ayah above follows the  فاء السببيةstructure. There is a wish [ ]...يا يلتfollowed by a  فاءfollowed by a \n)َ(فأفور\n \nفعل مضارع منصوب\n .\nNotice that the \n فاء\nالسببية\n clause explains the reason behind the wish and translates as “as a result”. \n \n َوَقَال\n \nفِرۡعَوۡن  يَ ٰهَ ٰمَ ٰن  \n  ٱبۡنِ \nِلِ َصَ ۡحا ا \nبۡل غ  \nَ\nِ ٓ أ\nلَّعََل \nسۡبَ ٰبَ \nٱۡلۡ َ\n  ٦٣ \nسۡبَ ٰبَ \nَ\nأ\n \nٱلسَّ مَ ٰوَ ٰتِ \nفَ  \nطَّ لِعَ إِِلَ ٰٓ إِلَٰهِ م وَسَ ٰ \nَ\nأ\nظ  نُّه  \nِ ۡلَ َ\nِإَوّن \nۥ \n ِكَ ٰذِباا وَكَذَ ٰلِكَ ز ي ِنَ لِفِرۡعَوۡنَ س وٓء  عَمَلِه\nۦ \nوَص  دَّ عَنِ \nٱلسَّ بِيلِٖۚ \n \nوَمَا كَيۡد  فِرۡعَوۡنَ إِالَّ ِفِ تَبَابٖ \n  ٧٣\nFiraun said, “Haman, build me a tower so that hopefully I might reach the ways - the ways to \nthe sky, then [as a result], I will look at Musa’s god... \nThe ayah above follows the  فاء السببيةstructure. There is a wish [ َّ ]...لَعَلfollowed by a  فاءfollowed by a \n \n )َ(فأطَّ ل ع\nفعل مضارع منصوب\n .\nNotice that the   فاء السببيةclause explains the reason behind the wish and translates as “as a result”. \n \n18",
    "language": "en",
    "section_title": "فا of Reasoning"
  },
  {
    "level": "advanced",
    "page": 18,
    "text": "Familiarize yourself with the following list of words. These are words that are commonly used when \nexpressing a wish.  \n َ  يلَ ْت َّ  لَعَل\nعَىس\n \nلَوْ/لَوْال\n  ْ  هَل\nif only \nperhaps \nhopefully/possibly \nif/why is it not that case that \ndid/is \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n19",
    "language": "en",
    "section_title": "فا of Reasoning"
  },
  {
    "level": "advanced",
    "page": 19,
    "text": "CHAPTER 5 -  ْن\nَ\n إِنْ وأ\n5.0 RECOMMENDED REVIEW \n✓ The Compound ( اسمChapter 12.5 –  )رصف\n \n ✓Shared Tools of Negation (Chapter 9.4 – Beginning  )نحو\n \nر ط الجازمة ✓\n( أدوات الشChapter 14.2 – Advanced  )نحو\n5.1 INTRODUCTION TO  ْأن \nWe learned about  ْن\nَ\n أas part of our study of  .احلروف انلاصبة للمضارعWe learned that it translates as “to” and \nthat it makes the  فعل مضارعthat follows it ( منصوبlight).  \n ْن\nَ\n ,أhowever, is a versatile  حرفthat can serve several different functions. In this chapter, we will be \nreviewing what we already know about  ْن\nَ\n أas well as learning about the other roles it can play.  \n5.1A \n ْن\nَ\nأ\n \nالمَصْ دَ رِيَّة\n \nRecall that during our study of the compound  ,اسمwe learned that  ْن\nَ\n أtransforms a  مجلة فعليةinto a  .مصدر\nThis type of  ْن\nَ\n أis called the نْ مَصْ دَر يَّة\nَ\n .أThis is because  ْن\nَ\n ,أin combination with the  فعلthat comes after it, \nfunctions and translates like a    .مصدر\nTake    يَذْهَبُ إىل املسجدas an example. It is a normal  .مجلة فعليةWhen  ْن\nَ\n أcomes before such a sentence, it \nbehaves like a  .مصدر\nنْ يَذْهَبَ إىل املسْج  د  \nَ\n أis equivalent to saying    .اذلَّهَابَ إ ىلَ المَسْج  دBoth translate as “to go to the masjid” and both \ncan be used the same way in a sentence. You could say \n ْذ\nَ\nنْ أ\nَ\nر يْدُ أ\nُ\nأ\nهَبَ إ ىلَ المَسْج  د  \n or   ر يْدُ اذلَّهابَ إ ىلَ المَسْج  د\nُ\n    .أ\nThis is the standard and most common usage of  ْن\nَ\n  .أ\n5.1B  ْن\nَ\n أMEANING “BECAUSE” \n ْن\nَ\n أcan sometimes serve the function of  .تَعْل يْلThe word  تَعْل يْلmeans “to give a reason” or “to explain”. \nWhen  ْن\nَ\n أis used for  ,تَعْل يْلit most naturally translates as “because”.  \nTake a look at the following examples.  \n َوَقَال\n \nرَج لٞ مُّؤۡمِنٞ م ِنۡ ءَالِ فِرۡعَوۡنَ يَكۡت م  إِيمَ ٰنَه  \n ۥٓ \nتَقۡت ل ونَ رَج ٗلً \nَ\nأ\nِ َ \nن يَق ولَ رَّب \nَ\nأ\nٱلِلَّ  \n  ٨٢  ... \nA man from the people of Firaun who was hiding his faith said, “Will you kill a man because \nhe says, ‘My master is Allah’”? \n20",
    "language": "en",
    "section_title": "فا of Reasoning"
  },
  {
    "level": "advanced",
    "page": 20,
    "text": "...\n \n َُي  ۡرِج ون\nٱلرَّس ولَ \n \nِإَويَّاك مۡ \nن ت ؤۡمِن واْ بِ \nَ\nأ\nٱلِلَّ ِ \n \nرَب ِك مۡ \n  ١  ... \nThey exile the prophet and you because you believe in Allah, your master. \n \n  وَمَا\nنَقَم واْ مِنۡه مۡ إِالَّ ٓ \nن ي ؤۡمِن واْ بِ \nَ\nأ\nٱلِلَّ ِ \n \nٱلۡعَزِيزِ \n \nٱۡلۡ َمِيدِ \n ٨  \nThey only resented them because they believed in Allah, the mighty, the praise-worthy. \n \n5.1C  ْن\nَ\n أMEANING “LEST” \n ْن\nَ\n أcan sometimes come in the meaning of “lest”. The word “lest” is an expression of caution or fear and \ncan translate as “in order to avoid the risk of…” \n ٰ َلۡق\nَ\nوَأ\nِفِ  \nۡرضِ \nٱۡلۡ َ\n \nرَوَ َٰسِ َ \nن تَمِيدَ بِك مۡ \nَ\nأ\n \nنۡهَ ٰراا وَس ب ٗلا لَّعَلَّك مۡ تَهۡتَد ونَ \nَ\nوَأ\n  ٥١\nAllah cast down pegs on earth lest it should sway with you and [He cast] rivers and paths so \nthat you may be guided.   \nAnother way to say this would be to say “Allah cast down pegs on earth in order to avoid the risk of it [the earth] \nswaying with you…” \n \n...\n \n  ِ ي بَني\n \nٱلِلَّ  \n \nلَك مۡ \nن تَضِ لُّواْ \nَ\nأ\nٱلِلَّ   وَ  \n \nِ َشَ ۡ ءٍ عَلِيم  ۢ \nبِك ل \n   ٦٧١\n. And Allah is knowing of all things.\nlest you go astray\n \nAllah clarifies for you\n \nAnother way to say this would be to say, “Allah clarifies for you to avoid the risk of you going astray…”  \n \n 5.1D  ْن\nَ\n أSTARTING A QUOTE \n ْن\nَ\n أcan be used to indicate the beginning of a quote. Quotation marks are not used in classical Arabic, nor \nis the word “saying” used to open a quote.  ْن\nَ\n أserves this function. When translating from Arabic to \nEnglish, the word “saying” can be added in brackets to capture the function of  ْن\nَ\n  .أ\nنْ \nَ\n أcan open a quote whether the quote is a  ,مجلة فعليةa  ,مجلة اسميةor a   .فعل أمر\n أنْ will only affect the status of an  ,فعل مضارعotherwise the  فعلwill stay as is. \nTake a look at the examples below.  \n21",
    "language": "en",
    "section_title": "إن و أن"
  },
  {
    "level": "advanced",
    "page": 21,
    "text": "ٰٓوَنَادَى\n \nصۡ حَ ٰب  \nَ\nأ\nٱۡلۡ َنَّةِ \n \nصۡ حَ ٰبَ \nَ\nأ\nٱنلَّارِ \n ن\nَ\nأ  \nقَدۡ وَجَدۡنَا مَا وَعَدَنَا رَبُّنَا حَق اا فَهَلۡ وَجَدتُّم مَّا وَعَدَ رَبُّك مۡ حَق ااۖۡ \n \nقَال واْ نَعَمۡ \n ۡذَّنَ م ؤَذ ِن  ۢ بَيۡنَه م\nَ\nفَأ\nن\nَ\nأ  \nلَّعۡنَة  \nٱلِلَّ ِ \n \nلَعَ َ \nٱلظَّٰلِ \n  ٤٤  مِنيَ \nThe people of Jannah will call out to the people of the fire [saying], “Certainly we have found \nwhat our Master promised us to be true, so have you found what your Master promised to be \ntrue?” They will say, “Yes”. Then a caller will call out among them [saying], “The curse of \nAllah is upon the wrongdoers!” \nThe first  أنbegins a quote that starts with a  .فعل ماضThe second  أنbegins a quote that is a  .مجلة اسميةIn both cases, \nthe  أنhas no grammatical effect.  \n \n ٓ  إِنَّا\nرۡسَلۡنَا ن وحًا إِِلَ ٰ قَوۡمِهِ \nَ\nأ\nنۡ  ۦٓ \nَ\nأ  \nَلِ مٞ \nَ\nتِيَه مۡ عَذَابٌ أ\nۡ\nن يَأ\nَ\nنذِرۡ قَوۡمَكَ مِن قَبۡلِ أ\nَ\nأ\n ١  \nCertainly WE sent Nuh to his people [commanding/saying], “Warn your people before a \npainful punishment comes to them.” \nThis  أنbegins a quote that starts with a  .فعل أمرNotice that the  أمرremains  ُمزومlike any other command, even \nthough it is preceded by an   .أن\n \n...\n \n َصۡ حَ ٰب\nَ\nوَنَادَوۡاْ أ\nٱۡلۡ َنَّةِ \n ن\nَ\nأ  \nسَلَ ٰمٌ عَلَيۡك مۡ  \n \nلَمۡ يَدۡخ ل وهَا وَه مۡ يَطۡ مَع ونَ \n  ٦٤\n” They will not have \nPeace be upon you.\n], “\nsaying\ncall the people of Jannah [\nAnd they will \nentered it but they will be hoping. \n \nThis  أنbegins a quote that is a  .مجلة اسميةNotice that the  أنhas no grammatical effect.   \n \nNote that this type of quote differs from a \n مقول\nالقول\n in that the quote does not have to be connected to \nthe word  .قالIn the examples above, ذَّنَ  ,نادَي\nَ\n ,أand  َرْسَل\nَ\n أare used. This allows for a wider variety in \nexpression.  \n \n5.1E \n َّن\nَ\nأ\n \nالم خَ فَّ فَ ة\n \n أنَّ differs from  ْن\nَ\n أin that it only affects أسم\nاء\n .Generally,  ْن\nَ\n أtranslates as “to” and  َّن\nَ\n أtranslates as “that”. \nThere are some cases in which you may see AN  ْن\nَ\n أTHAT IS ACTUALLY JUST  َّ أنWITHOUT A  شدِّةOR AN  .اسمThis is  \n22",
    "language": "en",
    "section_title": "إن و أن"
  },
  {
    "level": "advanced",
    "page": 22,
    "text": "called “ ,”أن خمففةor the “lightened  .”أنThere are some cases in which the  شدةand  فتحةare removed from \n َّن\nَ\n .أThere are two clues you can use to pinpoint the نَّ خمُ َفَّفَة\nَ\n :أ\n1) If the  فعلafter  ْن\nَ\n أis  ,مرفوعit is نَّ خمُ َفَّفَة\nَ\n .أIf it was an actual  ْن\nَ\n ,أit would make the  فعلafter it منص\nوب\n  .\n2) If the  ْن\nَ\n أappears where you would normally expect  َّن\nَ\n ,أit is نَّ خمُ َفَّفَة\nَ\n .أThere are certainly  أفعالthat \nusually come with  َّن\nَ\n أand not  ْن\nَ\n .أAmong them are  ُ عَل مَ يَعْلَمand ى يَرَى\nَ\n رَأand  ُّ  .ظَ نَّ يَظُ ن\nTake a look at the following examples.  \n...\n \n َعَلِم\nن\nَ\nأ  \nسَيَك ون  \n \nمِنك م مَّرَۡضَ ٰ \n  ٠٢  ...\nHe knew that there would be sick people among you…\n \n َ عَلِمis a  فعلthat comes with  ْن\nَ\n .أAlso notice that the  فعلafter  ْن\nَ\n أis  ,مرفوعnot  .منصوبThis means that it is نَّ ُم  َفَّفَة\nَ\n .أAlso \nnotice that it translates as “that”.  \n \n َفَٗل\nَ\nأ\n \nيَرَوۡنَ \nالَّ \nَ\nأ  \nيَرۡجِع  \n \nإَِلَ ۡهِمۡ قَوۡالا وَالَ يَمۡلِك  لَه مۡ ضَ اا وَالَ نَفۡعاا \n  ٩٨\nThen do they not see that it does not reply to them and does not possess harm or benefit for \nthem?\n \nى\nَ\n رَأis a  فعلthat comes with  ْن\nَ\n .أAlso notice that the  فعلafter  ْن\nَ\n أis  ,مرفوعnot  .منصوبThis means that it is نَّ ُم  َفَّفَة\nَ\n .أAlso \nnotice that it translates as “that”.  \n \n5.1F \n ْن\nَ\nأ\n \nالم فَ ِس ِ َة\n \nنْ \nَ\n أcan sometimes be used to explain or clarify something coming before it. This type of  ْن\nَ\n أfunctions and \ntranslates similar to a  بدلor a   .بيان\nTake a look at the following examples. \n  مَا\nمَرۡتَِنِ بِهِ \nَ\nق لۡت  لَه مۡ إِالَّ مَآ أ\nنِ  ۦٓ \nَ\nأ  \nٱعۡب د واْ \n \nٱلِلَّ َ \n \nِ وَرَبَّك مۡ \nرَّب \n   ٧١١  ...\nI only said to them what you commanded me to [that is to say] “Worship Allah, my Master \nand your Master”. \n \n ۡوَلَقَد\n \nءَاتَيۡنَا ل قۡمَ ٰنَ \nِكۡمَةَ \nٱۡلۡ\nنِ  \nَ\nأ  \nٱشۡك رۡ \n \n  ٢١  ... لِلِ َّ ِ \nAnd we certainly gave Luqman wisdom [that is to say] “Be grateful to Allah”.  \n23",
    "language": "en",
    "section_title": "إن و أن"
  },
  {
    "level": "advanced",
    "page": 23,
    "text": "5.1G \n ْن\nَ\nأ\n \nالزائدة\n \nنْ \nَ\n أcan sometimes be  .زائدةWhen it is  ,زائدةit serves as emphasis. The  أن الزائدةin particular only appears \nafter  .لَمَّاSince the  أنin this case is emphasizing  لَمَّاis translates as “finally”. Together they translate as \n“when finally”. \nTake a look at the following examples.  \n ٓوَلَمَّا\n \nن جَآءَتۡ ر س ل نَا ل وطا ا َسِ ٓءَ بِهِمۡ وَضَ اقَ بِهِمۡ ذَرۡٗعا ۖۡ \nَ\nأ\n  ٣٣  ...\nWhen our messengers finally came to Lut, he was caused agony by them and he was \ndistressed by them… \nNotice that the  أن زائدةcomes after  .لماNotice that the word “finally” is included in the translation to capture the   .توكيد\n \n ٓفَلَمَّا\n ن\nَ\nأ  \nجَآءَ \nلۡ ٱ\nبَشِۡي  \nلۡ  \nَ\nأ\nوَجۡ  لَعَ َ ٰ   قَىٰه  \n  تَدَّ  رۡ  ٱفَ  ۦ هِهِ \nبَصِ ۡيا \n  ٦٩  ... اۖۡ \nThen when the bringer of good news finally came, he threw it over his father’s face and he \nbecame able to see again…  \nNotice that the  أن زائدةcomes after  .لماNotice that the word “finally” is included in the translation to capture the   .توكيد\n \n5.2 INTRODUCTION TO  ْإن \nWe have come across  إنin two different places in our studies: as one of the ( أدوات الرشط اجلازمةmeaning \n“if”) and as part of the  إال+  إنtemplates. However,  ْ إ نdoes serve a couple more functions.  \n5.2A إن\n \nانلافية\n \nIn Chapter 9 of beginning  ,حنوwe learned that  إال+  إنand  إال+  ماare two templates which add the \nmeaning of “nothing but…” or “only”; the negation part (“nothing”) came from the  ماor the  ,إنand the \nexception (“but”) was made using  .إالHowever,  إنcan be used to negate a sentence – both  اسميةand  فعلية\n –without the presence of   .إال\nTake a look at the following examples.  \n ۡوَلَقَد\n \nمَكَّنَّٰه مۡ فِيمَآ \n  إِن \nمَّكَّنَّٰك مۡ فِيهِ \n...  \n  ٦٢\nWe had certainly established them in that which We did not establish you. \nNotice how  إنis negating the sentence; in this case, it is a   .مجلة فعلية\n24",
    "language": "en",
    "section_title": "إن و أن"
  },
  {
    "level": "advanced",
    "page": 24,
    "text": "…\n \n ۡ  إِن\nعِندَك م م ِن س لۡطَ ٰن  بِهَ ٰذَآ \n  ٨٦ …\nevidence in regards to this.\n \nno\nYou all have absolutely \n \nNotice how  إنis negating the sentence; in this case, it is a  .مجلة اسميةBecause  إنis a tool of negation, it allows for the \npresence of a  ,)من سلطان( من زائدةwhich is playing the role of the  .مبتدأ\n \n إن انلافيةis easily distinguishable from  إن الرشطيةbecause  إن انلافيةwill not make a  فعل مضارعlightest.  \n5.2B \n ْإن\n \nالمخفَّ فة\n \nSimilar to  إنْ  ,أنْ املخففةcan sometimes be  َّ إنwithout a  شدةor an  .اسمIn that case,  ْ إنwould serve the \npurpose of emphasis.  \nTake a look at the following example. \n ٓ  وَمَا\nنتَ إِالَّ بََشَ ٞ م ِثۡل نَا \nَ\nأ\n  ِإَون\nنَّظ  نُّكَ لَمِنَ \nٱلۡكَ ٰذِبِنيَ \n  ٦٨١ \nNo, you are nothing but a person like us, and we certainly think that you are from amongst \nthe liars! \nNotice how  إنis emphasizing the sentence. Also notice that the  فعلthat comes after it ( )نظنكis not lightest, which \neliminates the possibility of   .إن الرشطية\n \n \n \n \n \n \n \n \n \n \n \n25",
    "language": "en",
    "section_title": "إن و أن"
  },
  {
    "level": "advanced",
    "page": 25,
    "text": "CHAPTER 6 -  االشْ ت غَال\n6.0 RECOMMENDED READING \n✓ Abnormal Sentence Structure for a ( جملة اسميةChapter 5.4 – Beginning  )نحو\n \n ✓Abnormal Sentence Structure for a ( جملة فعليةChapter 6.6 – Beginning  )نحو\n6.1 INTRODUCTION \n االشتغالis a rhetorical device used in Arabic to bring special attention to a topic within a larger \nconversation. Grammatically, it looks similar to a  .مفعول به مقدمThe key difference is that the  مشغول عنه\nstructure always has a pronoun attached to the  .فعلThis pronoun matches in number and gender with \nthe portion that that looks like the   .مفعول به مقدم\nThis structure is made up of three parts that appear in the following order: \n1)  – املشغول عنهThe  اسم منصوبat the beginning of the structure  \n2)  – املشغولThe  فعل\n3) ال\n –  شاغلThe pronoun attached to the  ,فعلmatching the شم\nغول عنه\n \n \nرْضَ \nَ\nوَاأل\nمَدَدْنَاهَا\n \n \n \n \nNote: compare this to a sentence like  .نوحًا هَدَيْنَاThis looks similar to a  مشغول عنهstructure. The only \ndifference is the lack of a pronoun on the   .فعل\n6.2  FUNCTIONS OF االشتغال \nThe function of  املشغول عنهis  .االهتمام\n االهتمام\nSimilar to a  ,مبتدأa  املشغول عنهis brought forward to give it special attention, but unlike a  ,مبتدأit is not \nconsidered the main topic. For example, if an artist is asked about their painting at an exhibit, the \nconversation might look something like this:  \n :املشغول عنهan  اسمthat is  منصوبthat comes \nbefore the  فعل\n :الشاغلa pronoun attached to the  فعلthat \nrefers to the  ,مشغول عنهwhich it matches in \nnumber and gender. \n :املشغولthe  فعلthat comes after the \n اسم منصبو\n26",
    "language": "en",
    "section_title": "إن و أن"
  },
  {
    "level": "advanced",
    "page": 26,
    "text": "My painting… I spent a total of sixty hours working on it! I added so many details, my eyes \nalmost crossed. I even built the canvas myself. I think I used up approximately a ton of paint \non it.  \nNotice that even though the artist mentioned the painting first, it was not the main topic of their \ndiscourse. The painting was certainly an important element, but the artist’s focus was about his hand \nand effort in making the painting.  \nThis is the purpose of م\n , شغول عنهwhich is a known and recognized rhetorical device in classical Arabic. Let \nus take a look at some Arabic examples.  \n \nوَل وطً ا\n \nءَاتَيۡنَ ٰه  \n \nح كۡماا وَعِلۡماا وََنَ َّيۡنَ ٰه  مِنَ \nٱلۡقَرۡيَةِ \n \nٱلَِّتِ \n \nَكَ نَت تَّعۡمَل  \nٱۡلۡ َبَٰٓئِثَ  \n \nإِنَّه مۡ َكَ ن واْ قَوۡمَ سَوۡءٖ فَ ٰسِقِنيَ \n  ٤٧\nدۡخَلۡنَ ٰه  \nَ\nوَأ\nِفِ  \n  رَۡحۡ َتِنَآۖۡ إِنَّه\nۥ \nمِنَ \nٱلصَّٰ لِحِنيَ \n  ٥٧ \nAnd Lut – WE gave him wisdom and knowledge, and We rescued him from the village that \nused to commit foul deeds. No doubt, THEY were a rebellious nation of evil. We entered him \ninto Our mercy. Certainly, he is from amongst the righteous. \nNotice that Lut is brought forward for special attention, but the focus of the remainder of the ayaat is Allah’s mercy upon \nhim. \n \n    َنَّ ۡن\nمۡثَ ٰلَه مۡ تَبۡدِيٗلً \nَ\nۡسۡ َه مۡۖۡ ِإَوذَا شِئۡنَا بَدَّنلۡ َآ أ\nَ\nخَلَقۡنَ ٰه مۡ وَشَدَدۡنَآ أ\n  إِنَّ   ٨٢\n ۦ هَ ٰذِهِ \nتَذۡكِرَةٞۖۡ فَمَن شَآءَ \nٱَّتَّ َذَ \n \nإِِلَ ٰ رَب ِهِ \nۦ \nسَبِيٗلا \n  ٩٢\n  وَمَا\nن يَشَ آءَ \nَ\nتَشَ آء ونَ إِالَّ ٓ أ\nٱلِلَّ   \nإِنَّ  \nٱلِلَّ َ \n \nَكَ نَ عَلِيمًا حَكِيما \n  ٠٣ ا \nي دۡخِل  \n \nمَن يَشَ آء  ِفِ رَۡحۡ َتِهِ \nوَ  ۦ  \nٱلظَّٰلِمِنيَ \n \nعَدَّ \nَ\nأ\nلَه مۡ  \n \nعَذَابًا \n َلِ مَۢا\nَ\nأ\n  ١٣\nWE are the ones who created them and strengthened their physique, and when We will, We \nwill completely replace (them) with their likes. You do not will except that Allah wills. \nCertainly Allah has always been all-knowing and all-wise. He enters whom He wills into His \nmercy. As for the wrongdoers, He prepared for them a painful punishment. \nNotice that the main topic of the passage is Allah and His control over His creation. A special attention is given to the \ndisbelievers and their compensation. It is interesting to note that  سورة اإلنسانhas a great focus on the rewards of the \nbelievers in Jannah, as if to highlight the contrast between the compensations of the two parties. \n \n27",
    "language": "en",
    "section_title": "الأشتعال"
  },
  {
    "level": "advanced",
    "page": 27,
    "text": "6.3 مبتدأ VS عنه مشغول \nThe question arises, what is the difference between  املشغول عنهand  مبتدأwith a  مجلة فعليةas its  ?خربBoth of \nthem start with an  ,اسمare followed by a  ,فعلand have a pronoun that goes back to the starting  .اسم\nGrammatically, the only difference is the status. What is the difference in meaning?  \n➢  املشغول عنهis used to bring a special focus to a topic, but it is not the main topic at hand. \n➢  مبتدأis used to bring focus to the main topic at hand.  \nLet us take compare two passages to better understand the difference.  \n ۡوَلَقَد\n \nجَعَلۡنَا ِفِ \nٱلسَّ مَآءِ \n \nب ر وجا ا وَزَيَّنَّٰهَا لِلنَّٰظِرِينَ \n  ٦١\nوَحَفِظۡ نَ ٰهَا\n \nِ شَيۡطَ ٰنٖ رَّجِيمٍ \nمِن ك  \n  ٧١\n ِٖ َشَ ۡ ء\nۢنبَتۡنَا فِيهَا مِن ك  \nَ\nلۡقَيۡنَا فِيهَا رَوَ َٰسِ َ وَأ\nَ\nۡرضَ  مَدَدۡ نَ ٰهَا وَأ\nتۡبَعَه  ۥ شِهَابٞ مُّبِنيٞ ٨١ وَٱۡلۡ َ\nَ\nإِالَّ  مَنِ ٱسَۡتَ َقَ  ٱلسَّ مۡعَ  فَأ\n ٖمَّوۡز ون\n  ٩١\nوَجَعَلۡنَا\n \nلَك مۡ فِيهَا مَعَ ٰيِشَ وَمَن لَّسۡ ت مۡ َلَ  \nۥ \nبِرَ ٰزِقِنيَ \n٠٢\n \nWe have made constellations in the sky and We decorated it for the onlooker, and We \nprotected it from every accursed devil. Except the one who eavesdrops so a flagrant shooting \nstar pursues him. As for the earth, We have spread it out and placed in it mountains (lit., firm \npegs) and We caused to grow every balanced thing. We made living places in it for you and \nfor whoever you cannot at all provide for. \nIt is clear in the above passage that the main topic was not the earth itself, but Allah’s ability and what He provided for u s \nby means of the earth. Certainly, it has a special importance, but it is not the main topic.  \n \n  وَٱلشُّ عَرَآء\n \nيَتَّبِع ه م  \n \nٱلۡغَاو ۥنَ \nلَمۡ   ٤٢٢ \nَ\nأ  \nِ وَادٖ يَهِيم ونَ \nنَّه مۡ ِفِ ك  \nَ\nتَرَ أ\n   ٥٢٢\nنَّه مۡ يَق ول ونَ مَا الَ يَفۡعَل ونَ \nَ\nوَأ\n  إِالَّ   ٦٢٢\nٱَّلَّ ِينَ \n \nءَامَن واْ \n ْوَعَمِل وا\nٱلصَّٰلِحَ ٰتِ \n \nوَذَكَر واْ \nٱلِلَّ َ \n \nكَثِۡياا وَ \nٱنتََصَ واْ \n \nمِنۢ بَعۡدِ مَا ظ  لِم واْ  وَسَيَعۡلَم  \nٱَّلَّ ِينَ \n \nيَّ م نقَلَبٖ يَنقَلِب ونَ \nَ\nظَ لَم وٓاْ أ\n  ٧٢٢\n !Did you not see that they wander \nthem\nThe poets, those who are lost in error follow \naimlessly in every valley, and that they say what they do not do? Except for those who believe \nand did righteous deeds and they mentioned Allah often and were given victory after they \nwere wronged. Those who wrong will come to know what place of return they will go back to.\n \nNotice that the topic of the passage is the same as the  :مبتدأthe poets. The conversation revolves around them, as opposed \nto subject of the earth in the previous passage, where the conversation was revolving around Allah’s ability to create.  \n \n28",
    "language": "en",
    "section_title": "الأشتعال"
  },
  {
    "level": "advanced",
    "page": 28,
    "text": "6.4 مقدم به مفعول VS عنه مشغول \n مشغول عنهmay look like it is very similar to a  ;مفعول به مقدمgrammatically, the only different is  – الشاغلthe \npronoun that refers back to the  .مشغول عنهHowever, the rhetorical purpose is drastically different. Recall \nthat  تقديم اللفظ لَع اعملهcreates the meaning of exclusivity, which is not at all the purpose of   .املشغول عنه\nإِيَّاكَ \n \nنَعۡب د  \n \nِإَويَّاكَ \n \nنَسۡ تَعِني  \n ٥  \nWe worship you alone and seek assistance from you alone\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n29",
    "language": "en",
    "section_title": "الأشتعال"
  },
  {
    "level": "advanced",
    "page": 29,
    "text": "CHAPTER 7 -  ِّ   انلَّعْت السَّ بَب\n7.0 RECOMMENDED REVIEW \n✓ ( الموصوف والصفةChapter 4.5 – Beginning  )نحو\n \n ✓Rules of an Outside Doer (Chapter 6.3 – Beginning  )نحو\n \n أسماء ✓That Behave Like ( أفعالChapter 12.3 –  )رصف\n \n ✓Compound ( صفةChapter 13 – Advanced  )نحو\n7.1 INTRODUCTION  \nRecall that a  صفةcan appear, either in the form of a single word, a fragment, or a sentence. With every \ntype of  صفةwe have learned thus far, the  موصوفalways comes before the  .صفةIn this chapter, we will \nlearn  ,انلعت السببa structure that breaks this pattern. ( نعتis an alternate word for  ).صفة\n7.2 GRAMMATICAL STRUCTURE OF السبِب انلعت \nCompare the two following examples: \n \n ٌهَذَا رَجُل\nا تَّسَ خَتْ \n \nمَالب سُ هُ \n \nThis is a man whose clothing became dirty. \n \n ٌهَذَا رَجُل\nمُتَّس  خَةٌ مَالب سُ هُ \n \nThis is a dirty-clothed man. \nThe two examples translate similarly in English, but their grammatical structures differ. In the first of the \ntwo examples, the word  رجُلhas a standard compound  صفةin which a  مجلة فعليةis describing it.  \nThe second example is similar to the first. There is, however, one key difference. Recall from our  رصف\nstudies that some  أسماءcan act like a  فعلin that they can take a  مفعول بهor a  .فاعلIn this case, the  اسم فاعل\n )متسخة(replaces and functions like the  .)اتسخت( فعلThe word following it ( )مالبسهis still its   .فاعل\nIn the second example, the phrase ( )رجلٌ متَّسخةٌ مالبسُ هis a structure called  .انلعت السببLet us take a look at \nseveral examples of  نعت سببthen let us record our observations regarding the grammatical rules of this \nstructure.  \n30",
    "language": "en",
    "section_title": "الأشتعال"
  },
  {
    "level": "advanced",
    "page": 30,
    "text": "هْلُهَا\nَ\n مَرَرْنَا ب القَرْيَة الظَّ الم  أ\nهْلُهَا\nَ\nيْتُ القَرْيةَ الظَّ المَ أ\nَ\n رَأ\nهْلُهَا\nَ\n هَذ ه يه  َ القَرْيَةُ الظَّ ال مُ أ\nI passed by the village whose \npeople are oppressive. \nI saw the village whose \npeople are oppressive \nThis is the village whose \npeople are oppressive. \n \n \n \nهْلُهَا\nَ\nمَرَرْنَا ب قَرْيَة ظالم  أ\n \nهْلُهَا\nَ\nيْتُ قَرْيةً ظالمًا أ\nَ\nرَأ\n \nهْلُهَا\nَ\nهَذ ه قَرْيَةٌ ظال مٌ أ\n \nI passed by a village whose \npeople are oppressive. \nI saw a village whose people \nare oppressive \nThis is a village whose \npeople are oppressive. \n              \nNotice how:\n \n➢ the status of  أهلُهاremains constant in all examples \n➢ the  اعئدon  أهلهاgoes back to  القرية\n ➢the status of  ظالمfollows the status of  قرية\n ➢the type of  ظالمfollows the type of  قرية\n ظالم ➢does not match the gender of  قرية\n الظالم ➢is singular, despite its  )أهلها( فاعلbeing plural \nTHE LOGIC BEHIND THE RULES \nThink of the parts of  انلعت السببas follows:  \n \n \nهْلُهَا\nَ\nالقَرْيَة  الظَّ الم  أ\n \n \n \nThe grammar rules for  انلعت السببare as follows:  \n \nPSEUDO- فعلRULES: Follows all the same rules as a normal  فعلand  فاعل\no the  فعلmust be SINGULAR ( هوor  يهform) \no the  فاعلMATCHES the  فعلin GENDER \no the  فاعلmust come AFTER the  فعل\no the  فاعلmust be in the  رفعSTATUS \n \nPSEUDO- موصوفRULES: The psuedo- موصوفwill dicatate the STATUS and TYPE of the pseudo- فعل\n \n \n  \nفاعل\n pseudo- موصوف\npseudo- فعل\n31",
    "language": "en",
    "section_title": "Adjectives of Reasoning"
  },
  {
    "level": "advanced",
    "page": 31,
    "text": "7.3 RHETORICAL IMPLICATIONS OF   السبِب انلعت \nAs mentioned previously, the  نعت سببstructure bears resemblance to the complex  صفةstructure. So \nwhat distinguishes one from the other in terms of usage and meaning?  \n انلعت السببis unique because there are two descriptive relationships happening within a single \nconstruction. Let’s take a look at the first example from the chapter to see how this works. \n \n ٌرَجُل\n   \nمُتَّس  خَةٌ مَالب سُ هُ \n \n \na dirty-clothed man \nHere, dirty ( )متسخةis describing the clothes ( ,)مالبسهwhich is the word that comes after it. It does not describe the word that \ncomes before it, as is the case with normal  صفةconstructions. Additionally, the construction  متسخة مالبسهas a whole is \ndescribing the man. These are the two descriptive relationships in a single construction. The second word describes the \nthird. The second and third word together describe the first.  \n \n َّالقَرْيَة  الظ\nهْلُهَا\nَ\nالم  أ\n \n \nthe town whose people are oppressive (lit., the oppressive-peopled town) \nHere, oppressive ( )الظالمis describing the people ( ,)أهلهاwhich is the word that comes after it. It does not describe the word \nthat comes before it, as is the case with normal  صفةconstructions. Additionally, the construction\n \n الظالم أهلهاas a whole is \ndescribing the man. These are the two descriptive relationships in a single construction. The second word describes the \nthird. The second and third word together describe the first. \n \n \n \n \n \n \n \n \n \n \n \n32",
    "language": "en",
    "section_title": "Adjectives of Reasoning"
  },
  {
    "level": "advanced",
    "page": 32,
    "text": "CHAPTER 8 -  الفعل املايض واملضارع\n8.0 RECOMMENDED REVIEW \n✓ ر طية\n( الجملة الشChapter 14 – Advanced  )نحو\n8.1 INTRODUCTION TO الماَض الفعل \nOur study of  الفعل املايضwill be split into two categories:  \n1) Standard Usage  \n2) Non-Standard Usage   \nStandard usage is when the  فعل ماضis used according to its expected grammatical function – to express \nan action occurring in the past. Even within standard usage, the  فعل ماضcan serve a variety of \nimplications.  \nNon-standard usage is when the  فعل ماضtranslates as something other than the past-tense.    \n8.2 STANDARD USAGE OF الماَض الفعل  \nPLAIN PAST \nPlain past refers to the standard usage of the  .فعل ماضWithin plain past, the  فعل ماضcan be used to talk \nabout events that occurred in the RECENT PAST as well as events that occurred in the DISTANT PAST.  \nTake a look at an example of each.  \n ِوَلَيۡسَ ت\n \nٱلَّوۡبَة  \n \nلَِّلَّ ِينَ يَعۡمَل ونَ \nٱلسَّ ي ِئ\n  اتِ   َ \nحَدَه م  \nَ\nحَِتَّ ٰٓ إِذَا حََضَ َ أ\nٱلۡمَوۡت  \n \nِ \nقَالَ إِّن \nت بۡت  \n \nٱلَٰۡٔـنَ \n  ٨١  .. . \nRepentance is not for those who do evil until a time when death comes to one of them, then he \nsays, “I have repented now.”\n \nIn this ayah,    ت بْتis being used to talk about an event occurring in the recent past.  \n \n َخَلَق\n \nٱلِلَّ  \n \nٱلسَّ مَ ٰوَ ٰتِ \nوَ  \nۡرضَ \nٱۡلۡ َ\nبِ  \nٱۡلۡ َق ِٖۚ \n \nإِنَّ ِفِ ذَٰلِكَ ٓأَليَةا ل ِلۡم ؤۡمِنِنيَ \n  ٤٤\nHe created the skies and the earth with truth and purpose. No doubt, there is a sign for the \nbelievers in that.  \nIn this ayah,  َ خَلَقis used to talk about an event that occurred in the distant past.  \nA brief glance at the context can help determine whether the RECENT PAST or the DISTANT PAST is intended.  \n33",
    "language": "en",
    "section_title": "Adjectives of Reasoning"
  },
  {
    "level": "advanced",
    "page": 33,
    "text": "REPEATED PAST \nThe  ماضcan be used to talk about an action that occurred repeatedly in the past. Take a look at the \nfollowing examples.  \n \n \n ٰ َّفَتَوَِل\n \nعَنۡه مۡ وَقَالَ يَ ٰقَوۡمِ لَقَدۡ \nبۡلَغۡت ك مۡ \nَ\nأ\n \nِ \nرِسَ ٰلَ ٰتِ رَّب \nوَنَصَ حۡت  \n \nلَك مۡۖۡ \n  ٣٩  ...\nThen he turned away from them and said, “My people, I have certainly delivered the messages of \nmy Master to you and I have advised you.” \nHere, Shuaib (AS) is saying that he delivered the message and advised his people. There is no doubt that these actions \noccurred repeatedly, not just once.   \n \n \n َ  وَه و\nٱَّلَّ ِيٓ \n \nنزَلَ \nَ\nأ\n \nمِنَ \nٱلسَّ مَآءِ \n \nخۡ \nَ\nمَآءا فَأ\nرَجۡنَا بِهِ \nۦ \nِ َشَ ۡ ءٖ \nنَبَاتَ ك  \n  ٩٩ ...\nHe is the one who sent down water from the sky, then We brought forth plants of all sorts using \nit. \nThe sending down of rain is an action that has occurred repeatedly. \n \n \n َتِلۡك\nٱلرُّس ل  \n \nفَضَّ لۡنَا بَعۡضَ ه مۡ لَعَ َ ٰ \n \nبَعۡضٖ ٖۘ م ِنۡه م مَّن \n  ُكَ َّمَ \nٱلِلَّ ۖۡ \n \nوَرَفَعَ بَعۡضَ ه مۡ دَرَجَ ٰتٖٖۚ \n  ٣٥٢  ...\nThose are the messengers, We preferred some of them over others. Among them are those who \nAllah spoke to and He raised some of them in ranks.  \nThe messengers that Allah spoke to were spoken to on more than one occasion. \n \n \nRemember that  مضارع+  اكنcan also be used to express a continuous, past-tense action. This template is \ncommonly translated as “used to …” or “was …ing”.  \nThe difference between مضارع+ اكنand the regular  ماضis that مضارع+ اكنindicates a habit or a continuous \naction. \nSINGULAR PAST \nThe  ماضcan also be used to talk about a singular event – an action that occurred only once. Take a look \nat the following examples. \n34",
    "language": "en",
    "section_title": "Past and Present Verbs"
  },
  {
    "level": "advanced",
    "page": 34,
    "text": "َخَلَق\n \nٱلِلَّ  \n \nٱلسَّ مَ ٰوَ ٰتِ \nوَ  \nۡرضَ \nٱۡلۡ َ\nبِ  \nٱۡلۡ َق ِٖۚ \n \nإِنَّ ِفِ ذَٰلِكَ ٓأَليَةا ل ِلۡم ؤۡمِنِنيَ \n  ٤٤\nHe created the skies and the earth with truth and purpose. No doubt, there is a sign for the \nbelievers in that.  \nThe creation of the skies and the earth was a single event.  \n \n...\n \n َرۡسَلۡنَ ٰك\nَ\nوَأ\n \nلِلنَّاسِ رَس  \nوالا وَكََفَ ٰ بِ \nٱلِلَّ ِ \n \nشَهِيدا ا \n  ٩٧\nAnd We send you to the people as a messenger. And Allah is enough as a witness. \nThe messenger  ﷺwas sent once. This ayah described a singular event.  \n \nNote that \n اكن+ ماض\n can also be used to indicate a singular, past event. Take a look at the following \nexample.  \n...\n \n إِن\nك نت  ق لۡت ه  \nۥ \nفَقَدۡ عَلِمۡتَه  \n  ٦١١  ... ۥ \nIf I said it even once, you would already know it.  \nHere, Isa (AS) is saying that had he said it EVEN ONCE, Allah would already know it. \n َكن+\n ماض\n indicates a single occurrence.  \n 8.3 NON-STANDARD USAGE OF الماَض الفعل \nNon-standard usage of  الفعل املايضcovers cases in which the  فعل ماضis not necessarily translated as one.  \nDU’A \nThe past-tense can be used when making du’a for someone. It can be used either positively or \nnegatively.  \nA positive example would be  ُ شَفاكَ اهللor  َ غَفَرَ اهللُ لَكor  َ بارَكَ اهللُ ف يْكor   .جَزَاكَ اهللُ خَريْ ًا\nA negative example would be  ُ  .لَعَنَهُ اهلل\n َق تِل\n \nِنسَ ٰن  \nٱۡلۡ\n \nكۡفَرَه  \nَ\nمَآ أ\n  ٧١ ۥ\nMay the human be cursed. How disbelieving he is!  \nThe  فعل ماضin this ayah is not literal. It is being used as a du’a. For this reason, it translates as “May the human be cursed” \nrather than “The human was cursed”.  \n35",
    "language": "en",
    "section_title": "Past and Present Verbs"
  },
  {
    "level": "advanced",
    "page": 35,
    "text": "PROMISES AND WARNINGS  \nThe  ماضcan be used to make promises or to issue warnings. Though both promises and warnings are \nevents that are to occur in the future, the past is used as a form of emphasis or  توكيدas though to say \nthat it is so sure to happen, it is as though it is already done.  \nTake a look at the following examples. \n \n إِنَّا\nكَفَيۡنَ ٰكَ \n \nٱلۡم سۡ تَهۡزِءِينَ \n  ٥٩ \nCertainly WE will protect you against the mockers.  \nIn this ayah, Allah is making a promise to his Prophet  .ﷺHe uses the  ماضas a form of assurance and emphasis. \n \nوَنَا\n  دَىٰٓ \nصۡ حَ ٰب  \nَ\nأ\nٱۡلۡ َنَّةِ \n \nصۡ حَ ٰبَ \nَ\nأ\nٱنلَّارِ \n \nن قَدۡ وَجَدۡنَا مَا وَعَدَنَا رَبُّنَا حَق اا فَهَلۡ وَجَدتُّم مَّا وَعَدَ رَبُّك مۡ حَق ااۖۡ \nَ\nأ\n  ٤٤  ...\nAnd the people of Jannah will call out to the people of hell saying, “We have found what our \nMaster promised us to be true, so did you find what your Master promised to be true?” \nThis ayah describes a scene in the afterlife. The  ماضis often used to describe such scenes to emphasize that they are sure \nto occur. This emphasis also serves as a warning.  \n \n َوَن فِخ\nِفِ  \nٱلصُّ ورِ \n \nفَصَ عِقَ مَن ِفِ \nٱلسَّ مَ ٰوَ ٰتِ \n \nوَمَن ِفِ \nۡرضِ \nٱۡلۡ َ\n \nإِالَّ مَن شَآءَ \nٱلِلَّ ۖۡ \nث مَّ  \nن فِخَ \n \nخۡرَىٰ فَإِذَا ه مۡ قِيَامٞ يَنظ  ر ونَ \n \nفِيهِ أ\n  ٨٦\nAnd the horn will be blown in to and whoever is in the skies and whoever is in the earth will fall \ndown unconscious. Then it will be blown into again, and suddenly, they will be standing and \nwatching.  \nThis ayah describes a scene on the day of judgement. The  ماضis often used to describe such scenes to emphasize that \nthey are sure to occur. This emphasis serves as a warning.  \nWhen the  ماضis used for promises or warnings, it translates as a  .مضارعA device of emphasis such as \n“certainly” or “no doubt” can also be added to capture the rhetorical implication that comes with using \nthe  ماضto describe a future event.  \n36",
    "language": "en",
    "section_title": "Past and Present Verbs"
  },
  {
    "level": "advanced",
    "page": 36,
    "text": "صلة\n \nالموصول\n \nWhen a  فعل ماضappears in a  صلة املوصولit can be translated EITHER as a  ماضor as a  مضارعdepending on \ncontext and flow.  \nTake a look at the following examples \n ۡوَمَن\n \nحۡسَ ن  قَوۡالا \nَ\nأ\nم ِمَّن\n \nدَٗعَ ٓ إِِلَ \nٱلِلَّ ِ \n \nوَعَمِلَ صَ ٰلِحا ا وَقَالَ إِنَِّنِ مِنَ \nٱلۡم سۡ لِمِنيَ \n  ٣٣ \nAnd who is better in terms of speech that the one who calls toward Allah and does good and says, \n“Certainly I am from among those who submit.” \nHere, the  أفعالin the  صلةare all  .ماضHowever, it would not make sense to say that these actions occurred only in the past \nand are no longer occurring. These  أفعالare translated in the present tense.  \n \nٱَّلَّ ِي\n \nخَلَقَ \nٱلۡمَوۡتَ \nوَ  \nٱۡلۡ َيَوٰةَ \n \n  \nحۡسَ ن  عَمَٗلا\nَ\nيُّك مۡ أ\nَ\nَلِ َبۡل وَك مۡ أ\n \nوَه وَ \nٱلۡعَزِيز  \nٱلۡغَ  \n  ٢  ف ور  \nThe one who created death and life to test you which of you is best in terms of actions, and He is \nthe Mighty and the Forgiving.  \nThe contents of the  صلةin this ayah clearly describe a past event. In this case, the  ماضis translated as is.  \n  حيث\n/من \nحيث  \n \nWhen a  فعل ماضfollows the word  ,حيثit can be translated EITHER as a  ماضor as a  مضارعdepending on \ncontext and flow.  ُ حَيْثmeans “wherever.”  ُ م نْ حَيْثmeans “from the place where”.  \nTake a look at the following examples.  \nوَق لۡنَا\n \nيَٰٓـ َادَم  \nٱسۡك نۡ \n \nنتَ وَزَوۡج كَ \nَ\nأ\nٱۡلۡ َنَّةَ \n \nوَلُك  َ مِنۡهَا رَغَدًا \nحَيۡث  \n \nشِئۡت مَا\n  ٥٣  ... \nWe said, “O Adam, live, you and your wife in Jannah and eat from it freely wherever you want.” \nAllah is speaking to Adam and Hawa (AS) and telling them how they should live in Jannah. The speech revolves around \ntheir future in Jannah. For this reason, the word after  حيثmakes most sense translated in the   .مضارع\n \n ۡوَٱقۡت ل وه م\n \nحَيۡث  \n \nثَقِفۡت م وه مۡ \n \nخۡرِج وه م \nَ\nوَأ\nم ِنۡ حَيۡث  \n \nخۡرَج وك مۡ \nَ\nأ\n  ١٩١  ...\nKill them wherever you find them and expel them from the place where they expelled you. \nThe first  حيثappears in the context of a command concerning the present and the future. The second  حيثappears in the \ncontext of what happened to the Muslims.  \n37",
    "language": "en",
    "section_title": "Past and Present Verbs"
  },
  {
    "level": "advanced",
    "page": 37,
    "text": "وَلَمَّا\n \nدَخَل واْ \nمِنۡ حَيۡث  \n \nب وه م\nَ\nمَرَه مۡ أ\nَ\nأ\n  ٨٦  ... \nAnd when they entered from the place where their father commanded them… \nThe context of this ayah is the story of the journey of Yusuf’s brothers to Egypt. Their father commanded them to enter \nEgypt from a specific entrance BEFORE they departed. For this reason, it is translated in the past.  \nهمزة\n \nالتسوية\n \nThe words  َ سَواءٌ لَعare almost always followed by a  ,همزةa  ,فعل ماضthe word  ,أمand another  .فعل ماضThis \ntemplate is known as  همزة التسويةand translates as “It is the same for x, whether… or …” The  أفعالthat \nappear in this template translate as   .مضارع\nTake a look at the following examples to understand how this template is structured and translated.  \n \n َّ  إِن\nٱَّلَّ ِينَ \n \nكَفَر واْ \nسَوَآءٌ عَلَيۡهِمۡ \n ءَ  \nَ\nأ\nنذَرۡتَه مۡ \nمۡ  \nَ\nأ  \nلَمۡ ت نذِرۡه مۡ \n \nالَ ي ؤۡمِن ونَ \n٦  \nCertainly those who disbelieve, it is the same for them, whether you warn them or do not warn \nthem, they will not believe. \n  \n  ِإَون\nتَدۡع وه مۡ إِِلَ \nٱلۡه دَىٰ \n \nالَ يَتَّبِع وك مۡ \nسَوَآءٌ عَلَيۡك مۡ \n  \nَ\nدَ  أ\nعَوۡت م وه مۡ \nمۡ  \nَ\nأ  \nنت مۡ صَ ٰمِت ونَ \nَ\nأ\n  ٣٩١ \nAnd if you invite them to guidance, they will not follow you. It is the same for them whether you \ninvite them or whether you are silent. \n \n ٌسَوَآء\n \nعَلَيۡهِمۡ \n  \nَ\nأ\nسۡتَغۡفَرۡتَ لَه مۡ \nمۡ  \nَ\nأ  \nلَمۡ تَسۡ تَغۡفِرۡ لَه مۡ \nلَن  \nيَغۡفِرَ \nٱلِلَّ  \n \nلَه مۡ إِنَّ \nٱلِلَّ َ \n \nالَ يَهۡدِي \nٱلۡقَوۡمَ \n \nٱلۡفَ ٰسِقِنيَ \n ٦  \nIt is the same for them whether you seek forgiveness for them or do not seek forgiveness for \nthem. Allah will not forgive them. Certainly, Allah, He does not guide a corrupt nation.  \n لوال\nRecall that  لَوْالmeans “why not…?” or “if only…” When  لَوْالis followed by a  ,فعل ماضit can translate either \nas  ماضor   .مضارع\nTake a look at the following examples.  \n38",
    "language": "en",
    "section_title": "Past and Present Verbs"
  },
  {
    "level": "advanced",
    "page": 38,
    "text": "...\n \n ِ فَيَق ولَ رَب\nلَوۡالَ ٓ \n \nخَّرۡتَِنِ ٓ \nَ\nأ\n \nجَلٖ قَرِيبٖ \nَ\nإِِلَ ٰٓ أ\n  ٠١  ... \nThen he will say, “My Master, why don’t you reprieve me for a little while…?” \nThe request being made is a request regarding the present. For this reason, it makes most sense to translate it as   .مضارع\n \n ْوَقَال وا\n \nلَوۡالَ \n \nن ز ِلَ \n \nهَ ٰذَا \nٱلۡق رۡءَان  \n \nلَعَ َ ٰ رَج لٖ م ِنَ \nٱلۡقَرۡيَتَنيۡ ِ \n \nعَظِيمٍ \n  ١٣\nAnd they said, “Why was this Quran not sent down upon a great man from the two towns?” \nThe sending down of the Quran is a past event. For this reason it makes most sense to translate it as   .ماض\n \nاۡلملة\n \nالَشطية\n \nAs we learned previously, all of the أدوات ال\nرشط\n except for  ْ لَوpush the meaning of the  فعل ماضto  .مضارعIf \nboth the  ماضand the  مضارعtranslate the same way in a  ,مجلة رشطيةthis leaves us wondering why one \nwould be used over the other. Generally, when the  ماضis used in a  مجلة رشطيةit indicates a one-time \nevent. When the  مضارعis used, it indicates a recurring event.  \nTake a look at the following examples.  \n \nت بۡ   إِن\nد واْ \nٱلصَّ دَقَ ٰتِ \n \nفَنِعِمَّا ِهِ َ ۖۡ \n  ِإَون \nَّت  ۡف وهَا وَت ؤۡ \nت وهَا \nٱلۡف قَرَآءَ \n \nفَه وَ خَۡيۡ ٞ لَّك مۡ \n   ١٧٢  ...\nIf you disclose [your] charities, then what a beautiful thing they are. And if you conceal them and \ngive them to the poor, then it is better for you. \nGiving charity publicly and privately are actions that repeat. For this reason, the  مضارعis used.  \n \n  فَإِن\nطَ لَّقَهَا\nفَٗلَ  \n َتَ ِلُّ َلَ  \nۥ \nمِنۢ بَعۡد  حَِتَّ ٰ تَنكِحَ زَوۡجًا غَۡيۡ َه  \n   ٠٣٢  ... ۥ \nThen if he divorces her, she will not be permissible to him after that until she marries someone \nelse. \nDivorce between couples is not something that is repeated and renewed. For this reason, the  ماضis used. \n \n...\n  َ  مَن و\nيَشۡ ك رۡ \n \nفَإِنَّمَا يَشۡ ك ر  نلِ َفۡسِهِ \n  مَن وَ  ۦۖۡ \n  كَفَرَ \nفَإِنَّ \nٱلِلَّ َ \n \nغَِنِ ٌّ ۡحَ ِيدٞ \n  ٢١ \n39",
    "language": "en",
    "section_title": "Past and Present Verbs"
  },
  {
    "level": "advanced",
    "page": 39,
    "text": "Whoever is grateful, the he is only grateful for his own benefit. And whoever is ungrateful, then \ncertainly Allah is free of need and worthy of praise and thanks. \nGratitude is something that must be renewed constantly. It is not a one-time event. For this reason, the  مضارعis used. \nIngratitude or disbelief, on the other hand, is something that a person falls in. It does not have to be renewed or refreshed. \nFor this reason, the  ماضis used.  \n8.3 المضارع الفعل \nRecall that in terms of standard use, the  فعل مضارعis used for the present and future tense. As far as non-\nstandard use goes, we will be looking at three usages.  \nUSAGE 1: PAINTING A PICTURE \nSometimes, the Quran uses the  مضارعwhen telling a story from the PAST or relaying PAST events. Telling a \npast event as though it is occurring in the present captivates the listener and helps them visualize the \nevent.  \nTake a look at the following examples. \n ۡ  ِإَوذ\nَنَ َّيۡنَ ٰك م م ِنۡ ءَالِ فِرۡعَوۡنَ \nيَس  وم ونَك مۡ \n س وٓءَ \nٱلۡعَذَابِ \n \nي ذَّب ِ ونَ \n \nبۡنَآءَك مۡ \nَ\nأ\nوَيَسۡ تَحۡي ونَ \n \nن ِسَ آءَك مۡ \n  ٩٤  ...\nAnd remember when we saved you from the people of Firaun. They would inflict on you the worst \ntype of punishment and slaughter your children and let your women live… \nAllah is reminding the children of Israel of the trials that they went through. He uses the  مضارعto make them recall or \npicture the events more vividly.  \n \n ۡلَم\nَ\nأ  \nنَّ \nَ\nتَرَ أ\nٱلِلَّ َ \n  \nَ\nأ\nنزَلَ مِنَ \nٱلسَّ مَآءِ \n  مَآءا  \nفَت صۡ بِح  \n \nۡرض  \nٱۡلۡ َ\n \nُم  َۡضَ َّةً  \nإِنَّ \nٱلِلَّ َ \n \nلَطِيفٌ خَبِۡيٞ \n  ٣٦\nHave you not seen that Allah sent water down from the sky then the earth becomes green? \nCertainly, Allah is subtle and informed. \nThere is a switch to  مضارعpart-way through the ayah. The  مضارعis used to talk about the earth becoming green to allow \nlisteners to visualize and appreciate this miracle of nature.  \n \nEMPHATIC COMMAND \nThe  مضارعcan be used to issue commands. When the  مضارعis used for this purpose, it is more emphatic \nthat a regular  .أمرThe difference between the two is similar to the difference between saying, “Don’t go \nto that party” ( )أمرand “You are not going to that party” ( .)مضارعThe latter is more authoritative and \nassertive.  \n40",
    "language": "en",
    "section_title": "Past and Present Verbs"
  },
  {
    "level": "advanced",
    "page": 40,
    "text": "ۡ  ِإَوذ\nخَذۡنَا مِيثَ ٰقَك مۡ \nَ\nأ\nنف سَ ك م م ِن دِيَ ٰرِك مۡ \nَ\nالَ تَسۡ فِك ونَ دِمَآءَك مۡ وَالَ َّت  ۡرِج ونَ أ\n \nنت مۡ تَشۡ هَد ونَ \nَ\nقۡرَرۡت مۡ وَأ\nَ\nث مَّ أ\n  ٤٨\nAnd remember when we took a pledge from you, “You will not spill your own blood and will not \nexpel yourselves from you own homes!” Then you acknowledged while witnessing. \n \n \n ۡ  ِإَوذ\nخَذۡنَا مِيثَ ٰقَ بَِنِ ٓ إِۡسۡ َٰٓءِيلَ \nَ\nأ\nالَ تَعۡب د ونَ إِالَّ \nٱلِلَّ َ \n  ٣٨  ... \nAnd remember when we took a pledge from the children of Israel, “You will not worship anyone \nexcept for Allah!” \n \n  وَٱلۡم طَ لَّقَ ٰت\n \nيََتَ َبَّصۡ نَ \n \nنف سِهِنَّ ثَلَ ٰثَةَ ق ر وٓءٖٖۚ \nَ\nبِأ\n  ٨٢٢  ...\nDivorced women should wait by themselves for three periods… \n \n َو\nٱلۡوَ ٰلِدَ ٰت  \n \nي رۡضِ عۡنَ \n \nوۡلَٰدَه نَّ \nَ\nأ\nحَوۡ \nلَنيۡ ِ َكَ مِلَنيۡ ِ  \n  ٣٣٢  ...\nMothers should nurse their children for two full rounds… \n ْ إذ\nWhen a  فعل مضارعfollows  ,إذit can be translated either in the PAST or the FUTURE depending on context. \nGenerally, if the context is the afterlife, it translates in the future. If the context is a past event, it \ntranslated as a   .ماض\nTake a look at the following examples.  \n \n ۡ  ِإَوذ\nتَق ول  \n \nنۡعَمَ \nَ\nلَِّلَّ ِيٓ أ\nٱلِلَّ  \n \nمۡسِكۡ عَلَيۡكَ زَوۡجَكَ وَ \nَ\nنۡعَمۡتَ عَلَيۡهِ أ\nَ\nعَلَيۡهِ وَأ\n  ٱتَّقِ \nٱلِلَّ َ \n   ٧٣ ... \nWhen you said to the one who Allah blessed and who you blessed, “Keep your wife and be \nconscious of Allah”… \nIn this ayah, Allah is reminding the Prophet  ﷺof the advice he gave Zayd (R) regarding his marriage. This is a past event. \nFor this reason, the  فعل مضارعtranslates in the past tense.  \n \n41",
    "language": "en",
    "section_title": "Past and Present Verbs"
  },
  {
    "level": "advanced",
    "page": 41,
    "text": "ۡ  ِإَوذ\nيَتَحَآجُّونَ \nِفِ  \nٱنلَّارِ \n \nفَيَق ول  \nٱلضُّ عَفَٰٓؤ اْ \n \nلَِّلَّ ِينَ \nٱسۡتَكَۡبَ وٓاْ \n \nنت م مُّغۡن ونَ عَنَّا نَصِ يباا م ِنَ \nَ\nإِنَّا ك نَّا لَك مۡ تَبَعاا فَهَلۡ أ\nٱنلَّارِ \n   ٧٤ \nWhen they will argue with one another in the fire then the weak ones will say to those who were \narrogant, “Certainly, we were your followers, so will you relieve us a share of the fire?” \nThis ayah talks about a scene that will happen in the afterlife. This is a future event, which is why the  فعلafter  إذtranslates  \nas a   .مضارع\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n42",
    "language": "en",
    "section_title": "Past and Present Verbs"
  },
  {
    "level": "advanced",
    "page": 42,
    "text": "CHAPTER 9 - الم عَرَّف بِـ\n\" ال \"\n \n9.1 INTRODUCTION \nWe learned previously that  الtranslates as “the”. We found, however, that  الin Arabic is often used in \nplaces where a “the” in English would not be used or would sound unnatural. This is because the  ال\nserves several functions.  \nLet us learn about the five most common functions of   .ال\n9.2 THE FUNCTIONS OF ال  \n العَهْدِيَّة\nThe word  عهدmeans “familiarity”. This type of  الis used when both the speaker and the listener are \nfamiliar with what is being referred to. It is used to refer to something specific that both the speaker and \nthe listener know about. This type of  الis generally translated as “the”. \nTake a look at the following example.  \n َم ر ون\nۡ\nتَأ\nَ\nأ\nٱنلَّاسَ \nبِ  \nٱلَۡبِ ِ \n \nنت  \nَ\nنف سَ ك مۡ وَأ\nَ\nوَتَنسَ وۡنَ أ\nمۡ تَتۡل ونَ \nٱلۡكِتَ ٰبَ  \n \nفَٗلَ تَعۡقِل ونَ \nَ\nأ\n  ٤٤\nDo you command people to righteousness and forget yourselves while you recite the book. Do \nyou not comprehend?  \nBoth the speaker (Allah) and the listeners (the children of Israel) know what “the book” is. This is an   .ال العهدية\n اۡلِنْس\nThe word  جنسmeans “category” or “species”. The  الcan be used to refer to an entire category or \nspecies, animate or inanimate. When this type of  الis used, a “the” DOES NOT appear in the translation in \nmost cases. When this type of  الis used, the word often translates as a plural, even if it is grammatically \nsingular.  \nTake a look at the following examples.  \nٱَّلَّ ِي\n \nجَعَلَ لَك م م ِنَ \nٱلشَّ جَرِ \n \nخَۡضَ ِ \nٱۡلۡ َ\n \nنت م م ِنۡه  ت وقِد ونَ \nَ\nنَاراا فَإِذَآ أ\n   ٠٨\n, then (surprisingly) you kindle from it. \ngreen trees\nThe one who made for you fire from \n \n الشجر اۡلخَضis not referring to a specific green tree that is known to everyone. It is referring to the category or species of \ngreen trees (i.e. trees with leaves). Notice that the word “the” is not used in the translations and that it translates as a plural \ndespite being grammatically singular.  \n \n43",
    "language": "en",
    "section_title": "Past and Present Verbs"
  },
  {
    "level": "advanced",
    "page": 43,
    "text": "...\n ِصَ ل ِبَنَّك مۡ ِفِ ج ذ وع\nوَۡلَ \nٱنلَّخۡلِ \n \nبۡ \nَ\nشَدُّ عَذَاباا وَأ\nَ\nيُّنَآ أ\nَ\nوَلَ َعۡلَم نَّ أ\n   ١٧ قَ ٰ \nAnd I will most certainly crucify you on the trunks of palm trees and you will most certainly \nknow which of us are more intense in punishment and more ever-lasting.  \n انلخلis not referring to specific palm trees that are known to everyone. It is referring to the category of palm trees as a \nwhole. Notice that there is no “the” in the translations and that it translates as a plural despite being grammatically \nsingular. \n االسْ تِغْراق\nThe word  استغراقliterally means “immersion” or “full inclusion”.  الم االستغراقis a type of ال\n . م اجلنسThe \ndifference between them is that  الم االستغراقis used to include every individual within that category.  الم\n اجلنسspeaks of the category or species in general, but does not necessarily include every individual \nwithin that category. This type of  الdoes not translate with a “the”. “All” or “every” may be used to \ncapture the   .استغراق\nTake a look at the following examples.  \n...\n \n  يَوۡمَ يَنظ  ر\nٱلۡمَرۡء  \n \nمَا قَدَّمَتۡ يَدَاه  وَيَق ول  \nٱلَۡكَ فِر  \n \nيَ ٰلَيۡتَِنِ ك نت  ت رَ ٰبَۢا \n   ٠٤\n…the day on which every man looks at what he put forward and every disbeliever says, “I wish \nI was dirt!” \n المرءand  الَكفرare not referring to a specific man or a specific disbeliever nor are they simply referring to the categories of \nmen and disbelievers. Rather, EVERY man will be looking at their deeds that day. EVERY disbeliever will be wishing that they \nwere dirt.  \n \n  ي رِيد\n \nٱلِلَّ  \n \nن ُي  َف ِفَ عَنك مۡ وَخ لِقَ \nَ\nأ\nِنسَ ٰن  \nٱۡلۡ\n \nضَ عِيفاا \n   ٨٢\nwere created weak.\n \nhumans\nall \nAllah wants to lighten your load. And \n \n اۡلنسانis not referring to a specific human nor is it referring to the category in general. Rather, it is referring to each and \nevery individual in the category.  \n \nTo determine whether an  الis  استغراقor just plain  ,جنسsimply ask if there are exceptions to the \nstatement.  If there are, it is ( جنسe.g.    .)يف  ْ جُذُوْع  انلَّخْلOtherwise, it is  .استغراقRemember that  استغراقis a \ntype of  .جنسThis means that every  استغراقis also a  ,جنسbut not every  جنسis an   .استغراق\n \n44",
    "language": "en",
    "section_title": "Definitive by أل"
  },
  {
    "level": "advanced",
    "page": 44,
    "text": "المصادر\nIdeas are generally proper. The  مصدرoften appears with an  الon it. This  الdoes not generally translate.  \nيُّهَا\nَ\nيَٰٓأ\n \nٱَّلَّ ِينَ \n \nوَۡلِ َآءَ إِنِ \nَ\nءَامَن واْ الَ تَتَّخِذ وٓاْ ءَابَآءَك مۡ ِإَوخۡوَ ٰنَك مۡ أ\nٱسۡتَحَبُّواْ \n \nٱلۡك فۡرَ \n \nلَعَ َ \nِيمَ ٰنِٖۚ \nٱۡلۡ\n   ٣٢ ... \nYou who believe, do not take your parents and siblings as protective friends if they prefer \ndisbelief over faith…\n \n الكفرand  اۡليمانare  مصادرthat take an  الthat does not translate.  \n اۡلقيقة\n الcan sometimes be used to refer to an individual in a category. This usage of  الis not very common. \nWhen this  الis used, the word translates like a common word without a “the”. \nTake a look at the following example.  \n ْقَال وا\n \nكَلَه  \nَ\nلَئِنۡ أ\nٱَّل ِئۡب  \n \nوََنَ ۡن  ع صۡ بَةٌ إِنَّآ إِذاا لَّخَ ِٰسِ ونَ \n  ٤١\nbe \n \ncertainly\ns him while we are a strong group, then we would \neat\n \na wolf\nThey said, “Surely, if \nlosers in that case.”\n \n االختصاص\nIn most cases, a  خربis common. When an  الappears on a  ,خربit can sometimes serve the function of \nexclusivity. Take a look at the following example.  \n َّعَد\nَ\nأ\n \nٱلِلَّ  \n \nلَه مۡ جَنَّٰتٖ ُتَ ۡرِي مِن َتَ ۡتِهَا \nنۡهَ ٰر  \nٱۡلۡ َ\n \nخَ ِٰلِ ِينَ فِيهَا ذَٰلِكَ \nٱلۡفَوۡز  \n \nٱلۡعَظِيم  \n  ٩٨ \nAllah prepared for them gardens under which rivers flow, remaining in them forever. That is \nthe (only) great success. \n45",
    "language": "en",
    "section_title": "Definitive by أل"
  },
  {
    "level": "advanced",
    "page": 45,
    "text": "CHAPTER 10 -  اجلُمُوْع\n10.0 RECOMMENDED REVIEW \n✓ Plural Patterns (Chapter 13 –  )رصف\n10.1 INTRODUCTION  \nRecall that there are two types of plurals:  \n1)  ُ – اجلَمْعُ السَ ال مsound plurals  \n2)   \nْ – مجَ ْعُ اتلَّكْس  ريbroken plurals \nRecall that a plural is considered sound when the original form of the word is maintained and an ending \ncombination is used. A plural is considered broken when additional letters interrupt the original form of \nthe word.  \nMany words have both a sound version and one or more broken versions, which gives rise to two \nquestions that are essential in the study of plurals: \n1) When is the sound plural used and when is the broken plural used? \n2) Why are there different broken plural patterns and how do they differ in usage and meaning? \nLet us find the answer to each of these two questions.  \n10.2 SOUND VS. BROKEN \nKnow that the question of sound vs. broken is only relevant when there is an option to use either \nversion.  \nAs a general principal in  ,بالغةif there are no alternate ways of saying something, there is no sense in \nasking why it was said that way and how it may differ from an alternative. \nThe plural patterns that fall under the category of “no alternative” are the  ظرفpattern ( ُ )مَساج دand the \n آلةpattern ( ُ .)مَصاب يْحOur study will primarily involve plural patterns for other  ص  يَغin  رصفlike the  اسم فاعل\nand the  اسم صفةto name a few.  \nWhen it comes to sound vs. broken, there are generally two considerations as to which is used. They \nare: \n1)  – الق لَّة والكَْثْ َةThis refers to the range of numbers that that plural falls in.  القلةcan be anywhere \nfrom 3-10 and  الكْثةis more than 10.  \n2)    إرادة احلدث – إ رادَةُ احلَدْث  وإ رادَةُ االسْم يَّةis when the  اسمcarries a strong element of action and is \nbehaving similarly to a  إرادة االسمية .فعلis when the  اسمis used as a noun.  \nLet us learn about each of these two considerations in more detail.  \n \n46",
    "language": "en",
    "section_title": "Definitive by أل"
  },
  {
    "level": "advanced",
    "page": 46,
    "text": "القلة\n \nوالكرثة\n \nWhen it comes to inanimate objects, sound plurals are used for ( قلة3-10) and broken plurals are used for \n( كْثة11+).  \nTake a look at the following case study.  \n ٓ  وَمَا\nوۡلَ ٰد ك م بِ \nَ\nمۡوَ ٰل ك مۡ وَالَ ٓ أ\nَ\nأ\nٱلَِّتِ \n \nوْلَٰٓئِكَ لَه مۡ جَزَآء  \n \nت قَر ِب ك مۡ عِندَنَا ز لَۡفَ ٰٓ إِالَّ مَنۡ ءَامَنَ وَعَمِلَ صَ ٰلِحا ا فَأ\nٱلض ِ عۡفِ \n \nبِمَا \n ِعَمِل واْ وَه مۡ ِف\nٱلۡغ ر فَ ٰتِ \nءَ  \nامِن ونَ \n  ] ٧٣\n  [ سبأ\nYour money and children are not at all what will bring you closer to us, except for the one \nwho believes and does good deeds. Then those people, they will have double the reward \nbecause of what they did, and they will be safe in rooms.  \n  \n َوَٱَّلَّ ِين\n \nءَامَن واْ وَعَمِل واْ \nٱلصَّٰ لِحَ ٰتِ \n \nنلَ بَو ِئَنَّه م م ِنَ \nٱۡلۡ َنَّةِ\n \nغ رَفاا\n \nُتَ ۡرِي مِن َتَ ۡتِهَا \nنۡهَ ٰر  \nٱۡلۡ َ\n \nجۡر  \nَ\nخَ ِٰلِ ِينَ فِيهَا نِعۡمَ أ\nٱلۡعَ ٰمِلِنيَ \n ]   ٨٥ \nالعنكبوت\n[  \nThose who believe and do good, we will settle them in rooms in paradise under which rivers \nflow, remaining in it forever. And how amazing is the reward of those who work! \n \n ِلَ ٰكِن\n \nٱَّلَّ ِينَ \n \nٱتَّقَوۡاْ \n \nرَبَّه مۡ لَه مۡ \nغ رَفٞ \n \nم ِن فَوۡقِهَا \nغ رَفٞ \n \nمَّبۡنِيَّةٞ ُتَ ۡرِي مِن َتَ ۡتِهَا \nنۡهَ ٰر  ۖۡ \nٱۡلۡ َ\n  ] ٠٢  ... \nالزمر\n[  \nRather, those who have consciousness of their master, they will have rooms on top of which \nthere are built rooms under which gardens flow... \n  \nNotice that all three of these ayaat include a plural of the word  .غُرْفَةThe ayah in  سورة سبأuses the sound \nplural ( ,)غُرُفاتthe  .مجع قلةThe in  سورة العنكبوتuses the broken plural ( ,)غُرَفthe  ,مجع كْثةas does the ayah \nin   .سورة الزمر\nA look at the context gives us a clue as to why this may be the case.  \n1) The ayah in  سبأspeaks of those who believe and do good deeds,  مَنۡ ءَامَنَ وَعَمِلَ صَ ٰلِحا ا\n2) The ayaat in  العنكبوتand  الزمرboth speak of those who migrated for the sake of Allah.  \n \n \n47",
    "language": "en",
    "section_title": "Plural Patterns"
  },
  {
    "level": "advanced",
    "page": 47,
    "text": "Take a look at the ayaat in  العنكبوتand  الزمرthat speak about migration.  \n َيَ ٰعِبَادِي\n \nٱَّلَّ ِينَ \n \nءَامَن وٓاْ إِنَّ \nۡرَضِ \nَ\nأ\nوَ ٰسِعَةٞ \n \nفَإَِّيَّٰ َ فَ \nٱعۡب د ونِ \n   ٦٥ \nك  ُّ نَفۡسٖ ذَآئِقَة  \nٱلۡمَوۡتِ  \n \nث مَّ إَِلَ ۡنَا ت رۡجَع ونَ \n  ٧٥\n ۡ  ق ل\nيَ ٰعِبَادِ \nٱَّلَّ ِينَ \n \nءَامَن واْ \nٱتَّق واْ \n \nحۡسَ ن واْ ِفِ هَ ٰذِهِ \nَ\nرَبَّك مۡ لَِّلَّ ِينَ أ\nٱدلُّنۡيَا\n \nحَسَ نَةٞ  \nۡرض  \nَ\nوَأ\nٱلِلَّ ِ \n \nوَ ٰسِعَةٌ  \n \nإِنَّمَا ي  \nوََّفَّ \nٱلصََّٰبِ ونَ \n \nجۡرَه م بِغَۡيۡ ِ حِسَ ابٖ \nَ\nأ\n  ٠١\nNote: when the expansiveness of Allah’s earth is mentioned, it is an encouragement to the oppressed believers to migrate.  \nThe  مجع قلةis used for those who believe and do good and the  مجع كْثةis used for those who migrate. That \nis because those who migrate, the  ,مهاجرونare people who endured immense hardship and who \nsacrificed in order to hold on to their faith. These people, the  ,مهاجرونare higher in status than those \nwho did not have to endure what they endured. For this reason, their reward is greater and the  مجع كْثةis \nused for them.   \nإرادة\n \nاۡلدث\n \nوإرادة\n \nاالسمية\n \nThis rule applies specifically to the  اسم فاعلand its plurals.  \nRecall that we learned that the  اسم فاعلcan sometime behave and translate like a  .فعل مضارعThis is \nknown as  .إرادة احلدثThis term simply means that the intended meaning behind using the  اسم فاعلwas an \naction or a   .حدث\nWhen the  اسم فاعلis being used and translated as an  ,اسمthis is known as   .إرادة االسمية\nSOUND PLURALS are used for  ,إرادة احلدثwhen an action is intended.  \nBROKEN PLURALS are used for  ,إرادة االسميةwhen the noun is intended.  \nTake a look at the following case studies.  \nرۡسَلۡنَا\nَ\nوَأ\n \nٱلر ِيَ ٰحَ \n \nنزَنلۡ َا مِنَ \nَ\nلَوَ ٰقِحَ فَأ\nٱلسَّ مَآءِ \n \n \nَ\nمَآءا فَأ\nنت مۡ َلَ  \nَ\nسۡقَيۡنَ ٰك م وه  وَمَآ أ\nۥ \nبِخَ ٰزِنِنيَ \n  ٢٢ \nAnd We sent the winds as pollinators, then We sent down water from the sky and gave it to \nyou as drink. And you do not at all store it. \nThe sound plural of the  خازنis used because the focus is the action of storing. Notice that it translates as a  .مضارع\n \n َوَقَال\n \nٱَّلَّ ِينَ \nِفِ  \nٱنلَّارِ \n \nۡلِ َزَنَةِ \n \nجَهَنَّمَ \nٱدۡع واْ \n \nرَبَّك مۡ ُي  َف ِفۡ عَنَّا يَوۡماا م ِنَ \nٱلۡعَذَابِ \n  ٩٤ \n48",
    "language": "en",
    "section_title": "Plural Patterns"
  },
  {
    "level": "advanced",
    "page": 48,
    "text": "And those who are in the fire will say to the keepers of Hell, “Call upon your master to lighten \nthe punishment for us for a day!” \nThe broken plural of the  خازنis used because the word  خزنةis referring to a group of people. The focus is the people and \nnot the action. Notice that this translates as an    .اسم\n...\n ۡوَقَالَ لَه م\nخَزَنَت هَآ \nتِك مۡ ر س لٞ م ِنك مۡ يَتۡل ونَ عَلَيۡك مۡ ءَايَ ٰتِ رَب ِك مۡ وَي نذِر ونَك مۡ لِقَآءَ يَوۡمِك مۡ هَ ٰذَا \nۡ\nلَمۡ يَأ\nَ\nأ\n  ١٧  ...\nAnd its keepers said to them, “Didn’t messengers from among you come to you reciting the \nsigns of your master to you and warning you of the meeting of this day of yours?” \nThe broken plural of the  خازنis used because the word  خزنةis referring to a group of people. The focus is the people and \nnot the action. Notice that is translates as an    .اسم\n \n *            *             *\n \n...\n َٱٓأۡلمِر ون\nبِ  \nٱلۡمَعۡر وفِ \nوَ  \nٱنلَّاه ونَ \n \nعَنِ \nٱلۡم نكَرِ \nوَ  \nٱلۡحَ ٰفِظ  ونَ \n \nۡلِ د ودِ \nٱلِلَّ ِ  \n \nوَبََش ِ ِ \nٱلۡم ؤۡمِنِنيَ \n  ٢١١ \n…those who encourage what is good and forbid evil and those who maintain the boundaries \nof Allah… And congratulate the believers. \nThe sound plural of  حافظis used because the focus is the action of maintaining or protecting. Notice that it takes a  متعلق\n )ۡلدود الِل(that translates as a  مفعول بهjust like a  فعلwould.  \n \n  رۡسِلۡه\nَ\nأ\n \nمَعَنَا غَدا ا يَرۡتَعۡ وَيَلۡعَبۡ ِإَونَّا َلَ  \nۥ \nلَحَ ٰفِظ  ونَ \n  ٢١ \nSend him with us tomorrow to have fun and play. And we will definitely take care of him. \nThe sound plural of the  حافظis used because the focus is the action of storing. Notice that it translates as a   .مضارع\n \n...\n \n ۡوَي رۡسِل  عَلَيۡك م\nحَفَظَ ةً \n \n \nَ\nحَِتَّ ٰٓ إِذَا جَآءَ أ\nحَدَك م  \nٱلۡمَوۡت  \n \nتَوَفَّتۡه  ر س ل نَا وَه مۡ الَ ي فَر ِط  ونَ \n  ١٦\nAnd he sends upon you guardians until a time when death comes to one of you, our \nmessengers will take him in full and they will not overlook [anything at all].  \n \nThe broken plural of the  حافظis used because the word  حفظةis referring to a group of people. The focus is the \npeople and not the action. Notice that this translates as an    .اسم\n \n49",
    "language": "en",
    "section_title": "Plural Patterns"
  },
  {
    "level": "advanced",
    "page": 49,
    "text": "10.3 BROKEN PLURAL PATTERNS \nAgain, broken plurals are used for  . إرادة االسميةThere are, however, a number of broken plural patters, \neach with their unique usages and meanings.  \nLet us learn some of the most commonly used plural patterns and their unique meanings.  \n ٌ ف عَّال\nThis plural patters denotes  الكْثةin the ACTION. Note that this differs from saying that there is a  كْثةin the \nPEOPLE who do that action.  \nIt is like the difference between saying “He reads a lot” and “A lot of people read”. In the first example \nthe ( كْثةthe word a lot) is going back to the action, reading. In the second example, the ( كْثةthe word a \nlot) is going back to the people carrying out that action.  \nAgain, the plural patter  ٌ فُعَّالindicates a  كْثةin the ACTION.   \nThe word  ٌ ,حُفَّاظfor example, translates as “memorizers”. In order to capture the  ,كْثةrather than saying \n“a large number of memorizers,” we would say, “memorizers who memorize a lot.”  \nSimilarly, the word  ٌ زُرَّاعwould translate as “people who plant/farm a lot” rather than “a lot of farmers.” \nTake a look at the following case study.  \n َّ  إِن\nٱَّلَّ ِينَ \n \nكَفَر واْ وَصَ دُّواْ عَن سَبِيلِ \nٱلِلَّ ِ \nث مَّ  \nمَات واْ \n \nوَه مۡ \nك فَّارٞ \n \nفَلَن يَغۡفِرَ \nٱلِلَّ  \n \nلَه مۡ \n   ٤٣\n \n ِوَلَيۡسَ ت\n \nٱلَّوۡبَة  \n \nلَِّلَّ ِينَ يَعۡمَل ونَ \nٱلسَّ ي ِئ\n  اتِ   َ \nحَدَه م  \nَ\nحَِتَّ ٰٓ إِذَا حََضَ َ أ\nٱلۡمَوۡت  \n \nِ ت بۡت  \nقَالَ إِّن \nٱلَٰۡٔـنَ \n \nوَالَ \nٱَّلَّ ِينَ \n \nيَم وت ونَ \n \nوَه مۡ \n  ٌك فَّار\n \nَلِ ماا \nَ\nعۡتَدۡنَا لَه مۡ عَذَابًا أ\nَ\nوْلَٰٓئِكَ أ\n \nأ\n  ٨١\n \n َّ  إِن\nٱَّلَّ ِينَ \n \nكَفَر واْ \nوَمَات واْ \n \nوَه مۡ \nك فَّارٞ \n \nحَدِهِم م ِلۡ ء  \nَ\nفَلَن ي قۡبَلَ مِنۡ أ\nۡرضِ \nٱۡلۡ َ\n \nذَهَباا وَلَوِ \nٱفۡتَدَىٰ \n ۦٓ  هِ  بِ  \nَلِ مٞ \nَ\nوْلَٰٓئِكَ لَه مۡ عَذَابٌ أ\n \nأ\n َوَمَا لَه م م ِن نََّٰصِ ِين\n  ١٩\n \n َّ  إِن\nٱَّلَّ ِينَ \n \nكَفَر واْ \nوَمَات واْ \n \nوَه مۡ \nك فَّارٌ \n \nوْلَٰٓئِكَ عَلَيۡهِمۡ لَعۡنَة  \n \nأ\nٱلِلَّ ِ \nوَ  \nٱلۡمَلَٰٓئِكَةِ \nوَ  \nٱنلَّاسِ \n \nمجۡ َعِنيَ \nَ\nأ\n  ١٦١\nAs seen in the ayaat above, the plural \n ُ  فَّار كis often used in the context of death. Remember the plural \npattern  فُعَّالindicates  كْثةin an action. By the time a person reaches the stage of death, they have \nengaged in a lot of disbelief.  For this reason, the  فُعَّالpattern is used.  \n50",
    "language": "en",
    "section_title": "Plural Patterns"
  },
  {
    "level": "advanced",
    "page": 50,
    "text": "The word  كُفَّارis also often used in ayaat that were revealed in Al-Madina. Again, at this stage in the \nseerah of the Prophet  ,ﷺthe disbelievers have been engaged in  كفرfor long enough to warrant the \nuse of the  فُعَّالpattern.  \nيُّهَا\nَ\nيَٰٓأ\n \nٱنلَِّبِ ُّ \n \nجَ ٰهِدِ \nٱلۡك فَّارَ \nوَ  \nٱلۡم نَ ٰفِقِنيَ \nوَ  \nٱغۡل ظۡ \n \nعَلَيۡهِمۡ \n  ٣٧  ...\nO prophet, struggle against the hypocrites and be severe with them… \nThis ayah appears in  سورة الوبةwhich was revealed in the late madani stages, soon before the conquest of Makkah. \n \n...\n \n َفَإِنۡ عَلِمۡت م وه نَّ م ؤۡمِنَ ٰتٖ فَٗلَ تَرۡجِع وه نَّ إِِل\nٱلۡك فَّارِ  \n  ٠١  ... \nThen if you know them to be believers, then do not return them to the disbelievers.  \nThis ayah appears in  سورة الممتحنةwhich was revealed in Al-Madina in the context of women who used to flee from Makkah \nand take refuge in Al-Madina.  \n \n ُّٞمُّ َمَّد\n \nرَّس ول  \nٱلِلَّ ِ  \nوَ  \nٱَّلَّ ِينَ \n \nمَعَه  \n ۥٓ \nشِدَّآء  لَعَ َ \nَ\nأ\nٱلۡك فَّارِ \n \nر ۡحَ َآء  بَيۡنَه مۡۖۡ \n  ٩٢  ... \nMuhammad is the prophet of Allah. And those who are with him are harsh against the \ndisbelievers and merciful amongst themselves… \nThis ayah appears in  سورة الفتحwhich was revealed in the madani period after   .اۡلديبية\n فَعَلَةٌ \nThis plural pattern lacks action or movement. It is used to refer to a specific classification or \ncategorization of people. When this pattern is used, the focus is on the occupation, label, or \nclassification of that particular group.  \nTake a look at the following examples.  \n \n...\n \n ۡلَه م\nَ\nلۡقِ َ فِيهَا فَوۡجٞ سَأ\n \nُك  َّمَآ أ\nخَزَنَت هَآ \nتِك مۡ نَذِيرٞ \nۡ\nلَمۡ يَأ\nَ\n أ\n٨  \nWhenever a crowd is thrown in it, its keepers ask them, “Didn’t a warner come to you?” \nHere, the focus of the word is their occupation or label as gatekeepers.  \n \n \n51",
    "language": "en",
    "section_title": "Plural Patterns"
  },
  {
    "level": "advanced",
    "page": 51,
    "text": "...\n \n ۡوَي رۡسِل  عَلَيۡك م\nحَفَظَ ةً \n   ١٦  ... \nAnd We send guardians over you… \nHere, the focus of the word is their role or label as guardians.  \n \n َ ِلۡق\n \nوَأ\nٱلسَّ حَرَة  \n \nسَ ٰجِدِينَ \n  ٠٢١\nAnd the magicians were thrown down in prostration. \nHere, the focus of the word is their label or classification as magicians.  \nNote that the  ناقصversion of this plural pattern is  ٌ( فُعاةe.g.  ٌ )رُمَاةٌ  ,دُاعة\n ف عَّلٌ \nThis plural pattern is used to talk about individuals carrying out visibly apparent actions that span over a \nshort period of time.   \nTake a look at the following examples.  \n...\n ۡتَرَىٰه م\nر كَّعاا\n \nس جَّدا ا\n \nيَبۡتَغ ونَ فَضۡ ٗلا م ِنَ \nٱلِلَّ ِ \n \nوَرِضۡ وَ ٰنااۖۡ \n  ٩٢  ...\nYou see them in ruku and in prostration seeking favor and pleasure from Allah…  \nRuku and sujud are both physical actions that can be seen visibly. They are also actions that do not span over a long \nperiod of time.  \n   فَواعِل\nThis plural pattern can only be derived from the feminine  .اسم فاعلThis pattern is used for the inanimate. \nIt often implies stillness or lack of movement.   \nTake a look at the following examples.  \n ٰ َلۡق\nَ\nوَأ\nِفِ  \nۡرضِ \nٱۡلۡ َ\n \nرَوَ َٰسِ َ \n \nن تَمِيدَ بِك مۡ \nَ\nأ\n  ٥١  ...\nAnd He cast pegs on earth lest it shake with you… \nThe plural of  ٌ راسِيَةis  ِ .رَواَسThis means pegs or firm mountains. \n \n  وَٱلۡقَوَ ٰعِد\n \nمِنَ \nٱلن ِسَ آءِ \n \nٱلَِّٰتِ \n \nن \nَ\nن يَضَ عۡنَ ثِيَابَه نَّ غَۡيۡ َ م تََبَ ِجَ ٰت  بِزِينَةٖ وَأ\nَ\nالَ يَرۡج ونَ نِكَاحا ا فَلَيۡسَ عَلَيۡهِنَّ ج نَاحٌ أ\nيَ \nسۡ تَعۡفِفۡنَ خَۡيۡ ٞ لَّه نَّ وَ \nٱلِلَّ  \n \nسَمِيعٌ عَلِيمٞ \n  ٠٦\n52",
    "language": "en",
    "section_title": "Plural Patterns"
  },
  {
    "level": "advanced",
    "page": 52,
    "text": "And women who are past the age of child bearing who do not desire marriage, then there is \nno blame upon them if they take off their outer garments without flaunting their adornment. \nAnd keeping chaste is better for them. And Allah is seeing and knowing.  \nThe plural of  ٌ قاعِدَ ةis    .قَواعِدThis literally means a sitting, stationary woman, or more figuratively, a woman past the age of \nchild bearing. \n...\n َصَ ٰبِعَه مۡ ِفِ ٓ ءَاذَانِهِم م ِن\nَ\nَيَ ۡعَل ونَ أ\nٱلصَّ وَ ٰعِقِ \n \nحَذَرَ \nٱلۡمَوۡتِٖۚ \nٱلِلَّ   وَ  \n \nُّم  ِيُۢط بِ \nٱلۡكَ ٰفِرِينَ \n  ٩١ \nThey put their fingers in their earth because of the thunderbolts out of fear of death. And \nAllah will encompass the disbelievers.  \nThe plural of  ٌ صاعِقَةis    .صَ واعِقThis means a thunderbolt or strike that causes one to fall unconscious. \n ٌ ف عْٗلن\nThis pattern is used to express relative  .قلةIn other words, this plural pattern refers to a group that is \nsmall in number relative to another. \nLet us look at the comparative case study.  \n َوَٱَّلَّ ِين\n \nإِذَا ذ ك ِر واْ أَ‍ِب\nيَ ٰتِ رَب ِهِمۡ لَمۡ ُيَ ِ \nرُّواْ عَلَيۡهَا ص  م اا \nوَع مۡيَاناا\n  ٣٧ \nAnd those who, when they are reminded of the signs of their master, they do not fall upon \nthem deaf and blind.  \nThis ayah speaks about  ,عباد الرۡحنwhich is a group that is small relative to those who are misguided. For this reason,  َعْم\nَ\n أis \npluralized as  ٌ ,ع مْيانfollowing the  ٌ ف عْٗلنpattern. This is the only time in the Quran that  أعمis pluralized this way.  \n \nAll other ayaat use the plural  ٌ ْ .عُمNotice that all of these ayaat are in the context of people of \nmisguidance and disbelief. This is a relatively larger group.  \n ُّۢ  ص  م\nب كۡمٌ \nع مۡ ٞ \n \nفَه مۡ الَ يَرۡجِع ونَ \n  ٨١\n \n  وَمَثَل\n \nٱَّلَّ ِينَ \n \nكَفَر واْ كَمَثَلِ \nٱَّلَّ ِي\n \nيَنۡعِق  بِمَا الَ يَسۡ مَع  إِالَّ د ٗعَ ٓءا وَنِدَآءا  ص  مُّۢ ب كۡمٌ \nع مۡ ٞ \n \nفَه مۡ الَ يَعۡقِل ونَ \n  ١٧١\n \n...\n \n َوََنَ َۡش  ه مۡ يَوۡم\nٱلۡقِيَ ٰمَةِ \n \nلَعَ َ ٰ و ج وهِهِمۡ \nع مۡياا\n \nوَىٰه مۡ جَهَنَّم ۖۡ ُك  َّمَا خَبَتۡ زِدۡنَ ٰه مۡ سَعِۡياا \nۡ\nوَب كۡماا وَص  م ااۖۡ مَّأ\n  ٧٩\n \n ٓ  وَمَا\nنتَ بِهَ ٰدِي \nَ\nأ\nٱلۡع مۡ ِ \n \nعَن ضَ لَ ٰلَتِهِمۡۖۡ إِن ت سۡ مِع  إِالَّ مَن ي ؤۡمِن  أَ‍ِب\nيَ ٰتِنَا فَه م مُّسۡ لِم ونَ \n  ١٨\n \n53",
    "language": "en",
    "section_title": "Plural Patterns"
  },
  {
    "level": "advanced",
    "page": 53,
    "text": "َنت\nَ\nفَأ\nَ\nأ\n \nت سۡ مِع  \nٱلصُّ مَّ \n \nوۡ تَهۡدِي \nَ\nأ\nٱلۡع مۡ َ \n \nوَمَن َكَ نَ ِفِ ضَ لَ ٰلٖ مُّبِنيٖ \n  ٠٤\n \nLet us take a look at a comparative case study.  \n َت ون\nۡ\nتَأ\nَ\nأ\n \nٱَّلُّكۡرَانَ \n \nمِنَ \nٱلۡعَ ٰلَمِنيَ \n  ٥٦١ \nDo you approach males of all creatures? \nThis ayah is spoken by Lut (AS) when addressing his people. The  ٌ ف عْٗلنpattern is used because it was a specific group of \nmen that the people of Lut (AS) used to go after. This group of males is small in number relative to the broad category or \nmales.  \n \n ْوَقَال وا\n \nمَا ِفِ ب ط  ونِ هَ ٰذِهِ \nنۡعَ ٰمِ \nٱۡلۡ َ\n \nخَالِصَ ةٞ \nَّل ِ ك ورِنَا\n \nزۡوَ ٰجِنَاۖۡ \nَ\nوَُّم  َرَّمٌ لَعَ َ ٰٓ أ\n  ٩٣١  ...\nThey said, “Whatever is in the stomachs of these cattle is pure for our males and forbidden \nfor our wives…” \nThis ayah referring to a superstition of the  مَشكنيthat milk was only okay for males and was forbidden for females. This rule \nof theirs was not specific to a certain group of males, rather it was a general rule.   \n َفَعَْل\nوف   \nعاِلَ \n \nوفَعاِلَ \n \nThis plural patter is used for deficiency, calamity, or illness.  \nTake a look at the following examples.  \n َفَإِنَّك\n \nالَ ت سۡ مِع  \nٱلۡمَوۡتَ ٰ \n \nوَالَ ت سۡ مِع  \nٱلصُّ مَّ \n \nٱدلُّٗعَ ٓءَ \n \nإِذَا وَلَّوۡاْ م دۡبِرِينَ \n  ٢٥\nThen certainly, you do not make the dead hear nor do you make the blind hear the invitation \nwhen they turn away, giving you their backs.  \n الموتis the plural of  ٌ ,مَي ِتwhich means “dead person”. It follows this pattern because death is a calamity.  \n \nيُّهَا\nَ\nيَٰٓأ\n \nٱَّلَّ ِينَ \n \nءَامَن واْ الَ تَقۡرَب واْ \nٱلصَّ لَوٰةَ \n \nنت مۡ \nَ\nوَأ\nس كَ ٰرَىٰ \n \nحَِتَّ ٰ تَعۡلَم واْ مَا تَق ول ونَ \n  ٣٤ ...\nO you who believe, do not approach prayer while you are intoxicated until you understand \nwhat you are saying… \n س  َكرىis the plural of    ,سَكْرانwhich means drunk. It follows this pattern because drunkenness causes deficiency in intellect, \ndignity, and behavior.   \n \n54",
    "language": "en",
    "section_title": "Plural Patterns"
  },
  {
    "level": "advanced",
    "page": 54,
    "text": "ْوَءَات وا\n \nٱَلۡ َتَ ٰمَ ٰٓ \n \nمۡوَ ٰلَه مۡۖۡ وَالَ تَتَبَدَّل واْ \nَ\nأ\nٱۡلۡ َبِيثَ \nبِ  \nٱلطَّ ي ِبِ  \n  ٢  ... \nGive orphans their money and do not exchange the pure of the impure.  \n يَتاِمis the plural of  ٌ ,يَتِيْمwhich means orphan. It follows this pattern because losing a parent is considered a calamity.  \n  ف عَٗلء\n \nوفِعالٌ \n \nBoth of these patterns are plural patterns for the  .اسم صفةThe difference between them is that the  ُ فُعَالء\npattern is used in METAPHORICAL contexts while the  ٌ ف عالpattern is used in LITERAL contexts.  \n ْوَقَال وا\n \nطَ عۡنَا سَادَتَنَا \nَ\nرَبَّنَآ إِنَّآ أ\nوَك َبَ َآءَنَا\n \nضَ لُّونَا \nَ\nفَأ\nٱلسَّ بِيٗلَ ۠ \n  ٧٦ \nThey said, “Our Master, certainly, we obeyed our masters and noblemen, then they misguided \nus from the path”. \n كَباءis the plural of  .كبۡيThe  فعٗلءpattern is chosen over the  فعالpattern, because the meaning is non-literal. These people \nare not physically big. Rather, they are big in status and social rank.  \n \n ۡ  ِإَوذ\nيَتَحَآجُّونَ ِفِ \nٱنلَّارِ \n \nفَيَق ول  \nٱلضُّ عَفَٰٓؤ اْ \n \nلَِّلَّ ِينَ \nٱسۡتَكَۡبَ وٓاْ \n \nنت م مُّغۡن ونَ عَنَّا نَصِ يباا م ِنَ \nَ\nإِنَّا ك نَّا لَك مۡ تَبَعاا فَهَلۡ أ\nٱنلَّارِ \n  ٧٤ \nAnd when they are arguing in the fire, then the weak say to those who were arrogant, “We \ncertainly used to be followers for you, so will you protect us from some of the fire?” \n ضعفاءis the plural of  .ضعيفThe  فعٗلءpattern is chosen over the  فعالpattern, because the meaning is non-literal. These \npeople are not physically weak. Rather, they are blind followers who are mentally weak. \n \n ْٱنفِر وا\n \nخِفَافاا وَثِقَاالا \n \nنف سِك مۡ ِفِ سَبِيلِ \nَ\nمۡوَ ٰلِك مۡ وَأ\nَ\nوَجَ ٰهِد واْ بِأ\nٱلِلَّ ِ  \n  ١٤  ... \nGo forth light or heavy and strive with your wealth and yourselves in the path of Allah… \nThis ayah appears in the context of the battle of.  ,خفافthe plural of  خفيفrefers to people who have no armor and are \ntravelling light.  ثقالrefers to those who are wearing armor. This is a physical lightness and heaviness, which is why the  فعال\npattern is used.  \n \n َٱَّلَّ ِي  ه و\n \nي رِيك م  \nٱلَۡبَ ۡقَ \n \nخَوۡفاا وَطَ مَعاا وَي نشِئ  \nٱلسَّ حَابَ \n \nٱل ِقَالَ \n  ٢١ \nHe is the one who shows you lightning causing fear and hope and He generated heavy clouds.  \n ثقالis the plural of  .ثقيلThe  فعالpattern is chosen over the  فعٗلءpattern, because the meaning is literal. Rain clouds are \nphysically heavy.  \n55",
    "language": "en",
    "section_title": "Plural Patterns"
  },
  {
    "level": "advanced",
    "page": 55,
    "text": "Note that the  ُ فُعَالءpattern becomes  ُفْع الء\nَ\n أwhen the word is  مضاعفor  .ناقصFor example, the plural of \n شديدwould be  ُش  دَّاء\nَ\n .أThe plural    قَو يwould be  ُقْو ياء\nَ\n .أThe  ف عالpattern looks the same.  \nعَل \nوزن\n \nالمصدر\n \nThe  مصدرpatterns can sometimes be used as a plural pattern. When this happens, it implies that the \npeople belonging to this group are carrying out the action in its TRUE SENSE or its LITERAL SENSE. For \nexample,  ٌ سُجُوْدis a  مصدرpattern that means “prostration”. When  السجُوْدis used as a plural, it means \npeople who make TRUE   .سَجْدَة\nAn example of this plural pattern being used to denote something LITERAL would be  ٌ .ق يامThe word  َ قامcan \nmean to stand [lit.] or it can mean to stand in prayer [fig]. When the literal meaning is intended, the \n مصدرpattern ( )ق يامis used. When the figurative meaning is intended, the normal plural ( َ )قائ مُوْنis used.  \nTake a look at the following examples.  \n...\n \n َوَطَ ه ِرۡ بَيِۡتِ َ لِلطَّ آئِفِنيَ و\nٱلۡقَآئِمِنيَ \nوَ  \nٱلرُّكَّعِ \n \nٱلسُّ ج ودِ \n  ٦٢ \n…and purify my house for those who do tawaf and for those who stand [in prayer] and for \nthose who do ruku and true prostration. \nThe  مصدرpattern is used for  سجودto express that these people are doing  سجودin its true sense, meaning that their \nprostration is full of humility and   .خشوع\n  \n َٱَّلَّ ِين\n \nيَذۡك ر ونَ \nٱلِلَّ َ \n \nقِيَ ٰماا\n \nوَق ع وداا\n \nوَلَعَ َ ٰ \n ج ن وبِهِمۡ وَيَتَفَكَّر ونَ ِفِ خَلۡقِ \nٱلسَّ مَ ٰوَ ٰتِ \nوَ  \nۡرضِ \nٱۡلۡ َ\n  ١٩١  ... \nThose who remember Allah while standing, sitting, and on their sides and who think deeply \nabout the creation of the skies and the earth… \nHere “standing” and “sitting” are being used in their literal sense. This is why the  مصدرpattern is used.  \n56",
    "language": "en",
    "section_title": "Plural Patterns"
  }
]